import * as React from 'react';
import type { Metadata } from "next";
import LayoutMainRus from "@/components/LayoutMainRus";
import ContactFormRus from '@/components/contact-form/ContactFormRus';
import AnotherCasesRu from '@/components/anothercases/AnotherCasesRu';
import FadeInImage from '@/components/anothercases/FadeInImage';
import Image from 'next/image';

export const metadata: Metadata = {
  title: "Продвижение финансового сайта сервиса онлайн кредитов",
  description: "Кейс по созданию и SEO продвижению сервиса онлайн кредитов Ultracash. Работы: маркетинговый аудит, дизайн, разработка сайта, PPC, SEO.",
  alternates: {
    canonical: "https://web-machine.rocks/ru/cases/ultracash",
    languages: {
      en: "https://web-machine.rocks/cases/ultracash",
      ru: "https://web-machine.rocks/ru/cases/ultracash",
      uk: "https://web-machine.rocks/uk/cases/ultracash",
    },
  },
};

const CaseUltracashRu = () => {
  return (
    <>
  <LayoutMainRus>
  <div className="relative z-10 container mx-auto p-10 px-10 m-10 w-100">
        <h1 className={'unbounded'}>Продвижение сайта кредитных и финансовых услуг</h1>
        <p style={{fontSize: '24px'}} className={''}>Кейс по продвижению сервиса онлайн кредитов Ultracash, Украина. Работы: маркетинговый аудит, брендинг, продвижение сайта, продвижение в социальных сетях. Результаты: рост целевого трафика в 6 раз за 6 месяцев. ROMI (коэффициент возврата инвестиций в маркетинговый проект): 702% Период: 05.2017 — 11.2017</p>
       
        <br></br>
        <div className="video-container">
        <video 
          autoPlay 
          loop 
          muted 
          playsInline 
          className="w-full h-auto border-36"
          style={{background: '#000'}}
        >
          <source src="/images/portfolio/ultracash/ultracash-01.webm" type="video/webm" />
          Your browser does not support the video tag.
        </video>
        </div>
       
        <h2>Раскрутка и продвижение сайта кредитных услуг в Украине: dashboard проекта</h2>
        <p>ULTRACASH – это современный сервис по быстрому и безопасному оформлению денежных средств (кредитные услуги и финансовые услуги) на короткий срок. Оформление кредита онлайн с помощью ULTRACASH – это значит иметь возможность удобно взять необходимую сумму денег и при этом сэкономить массу времени. И главное, для этого нет необходимости посещать офис — всё оформление, включая подачу заявки, её рассмотрение - происходит онлайн! Сайт был только что сверстан и перенесен на собственный домен и перед нами стояла задача в краткие сроки продвинуть сайт кредитных услуг и дать клиенту необходимый поток заявок на кредиты от потенциальных заемщиков.</p>
        <p>Оценив возможности и угрозы при продвижении финансовых услуг именно в этой нише (продвижение кредитов онлайн) мы предоставили прогнозные данные и оговорили возможные риски при продвижении кредитных услуг и продуктов, между тем возможности тоже были, что позволило с большей долей уверенности приступать к продвижению финансовых услуг компании Ultra Cash. Обсудив предстоящий фронт работ мы собрали рабочую группу проекта и составили стратегию продвижения кредитных услуг и продуктов компании на рынке. В состав работ входили, как работы по стандартной оптимизации так и вывод компании на рынок по средствам PR плюс управление репутацией в социальных медиа.</p>
        
        <h2>Задачи по продвижению кредитных услуг</h2>
        <ol className='spoilerOlStyle'>
        <li>Повышение видимости предложения по услугам кредитования на целевом рынке</li>
        <li>Рост и оптимизация конверсий на сайте по предоставлению услуг кредитования UltraCash</li>
        <li>Продвижение кредитных услуг на высоко-конкурентном рынке</li>
        <li>Управление репутацией (влияние отзывов и деловой репутации в данной рыночной нише - краткосрочных кредитов населению - крайне важна и является неотъемлемой частью общей концепции) </li>
        </ol>
        <h2>Маркетинг и обзор рыночной конъюнктуры</h2>
        <p>Проект ULTRACASH работает по предоставлению услуг на потребительском рынке (B2C).</p>
        <p>Целевая аудитория проекта:</p>
        <p>мужчины (65%), женщины (35%)</p>
        <p>возраст: 25-34 (57%)</p>
        <Image className="border-12" src='/images/portfolio/ultracash/ultracash-02.webp' width={800} height={800} alt='Продвижение финансового сайта сервиса онлайн кредитов'/>
        <p><b>география:</b> крупные города (Киев - более 37%, Харьков, Днепр, Львов, Одесса, Запорожье, Полтава)</p>
        <p><b>род деятельности:</b> работающие, служащие.</p>
        <p>Таким образом, основным портретом целевого клиента является работающий мужчина 25-34 лет, проживающий в крупном городе. Второй портрет - это трудоустроенная 25-34-летняя женщина, проживающая в областном центре.</p>
        <h3>Конкурентная среда:</h3>
        <p>Прямыми конкурентами проекта являются все компании, предоставляющие услуги быстрого кредитования онлайн в Украине, среди которых: moneyveo.ua, moneyboom.ua, zajmonline.com.ua, credit365.ua, crediton.org.ua, kreditmarket.ua, krediti-online.com.ua.</p>
        <p>Большая часть этих компаний проводит массированную рекламную кампанию, включающую в своём маркетинговом плане рекламу на TV, онлайн рекламу, поисковый маркетинг и ощутимую активность в социальных медиа.</p>

        <h2>Ключевые моменты реализации</h2>
        <p>Для достижения поставленных целей по продвижению кредитных услуг была разработана стратегия интернет-маркетинга, предполагающая следующие основные этапы:</p>
        <p>1 этап. Повышение видимости предложения и рост конверсий.</p>
        <p>Основным каналами на данном этапе являются:</p>
        <ul className='spoilerUlStyle'>
            <li>SEO. Основным KPI на данном этапе являются % видимости (совокупность значений позиций в Google), % новых посетителей сайта</li>
            <li>SMM. Рост аудитории и вовлечение в процесс обсуждения.</li>
            <li>PPC (в том числе ремаркетинг).</li>
        </ul>
        <br></br>
        <p>2 этап. Оптимизация конверсий и управление репутацией.</p>
        <p>Основным каналами на данном этапе являются:</p>
        <ul className='spoilerUlStyle'>
            <li>SEO. Основным KPI на данном этапе являются % конверсий, % повторных посетителей сайта, средняя продолжительность сеанса, показатель отказов, ROI</li>
            <li>SMM. Дальнейший рост аудитории и вовлечение в процесс обсуждения - создание эффективной коммуникационной площадки.</li>
            <li>PPC (в том числе ремаркетинг).</li>
        </ul>
        <p>Всего было задействовано 9 коммуникационных каналов, работа по привлечению посетителей ведётся по 324 целевым источникам.</p>
        
        <h2>Решения по деталям (позиционирование и функционал)</h2>
        <FadeInImage src="/images/portfolio/ultracash/ultracash-03.webp" alt="Продвижение финансового сайта сервиса онлайн кредитов" />
        <h3>Позиционирование при продвижении сайта с кредитными услугами</h3>
        <p>Задача заключалась не только в получении постоянных заявок с сайта и притока новых клиентов, но и в выстраивании с ними доверительных и долгосрочных отношений для заключения последующих сделок.</p>
        <p>Для этого был создан вымышленный персонаж, который принимает активное участие во взаимоотношениях с клиентами компании и помогает в сложных ситуациях при получении кредитных продуктов, а также консультирует по финансовым продуктам компании UltraCash.</p>
        <p>Также на постоянной основе наш герой осуществляет всевозможные мероприятия в социальных медиа и раздает промо-коды потенциальным клиентам.</p>
        <p>Этому герою мы дали имя созвучное с названием самого сервиса - Ультрамен.</p>

        <FadeInImage src="/images/portfolio/ultracash/ultracash-04.webp" alt="Продвижение финансового сайта сервиса онлайн кредитов" />
       <h2>Результаты продвижения финансовых услуг компании</h2>
       <p>Видимость ресурса за 6 месяцев:</p>
       <Image className="border-12" src='/images/portfolio/ultracash/ultracash-05.webp' width={800} height={800} alt='Продвижение финансового сайта сервиса онлайн кредитов'/>
       <p>Прогноз трафика в разрезе 3 месяцев:</p>
       <Image className="border-12" src='/images/portfolio/ultracash/ultracash-06.webp' width={800} height={800} alt='Продвижение финансового сайта сервиса онлайн кредитов'/>
       <p>Трафик из Google Organic:</p>
       <Image className="border-12" src='/images/portfolio/ultracash/ultracash-07.webp' width={800} height={800} alt='Продвижение финансового сайта сервиса онлайн кредитов'/>
       <p>Сейчас продолжаем работы по повышению видимости сайта кредитных услуг в выдаче поисковой системы Google.com.ua (расширение семантики, продвижение по смежным интересам и ключевым запросам).</p>
    <p>Выполнение целей и трафик в сравнении по году за период 6 месяцев из Google Organic:</p>
        <Image className="border-12" src='/images/portfolio/ultracash/ultracash-08.webp' width={800} height={800} alt='Продвижение финансового сайта сервиса онлайн кредитов'/>
      <p>Некоторые позиции на 17.07.2017 г.</p>
      <Image className="border-12" src='/images/portfolio/ultracash/ultracash-09.webp' width={800} height={800} alt='Продвижение финансового сайта сервиса онлайн кредитов'/>
       
        <h2>Отзыв клиента</h2>
        <blockquote className="blockquote-6">
        <p>Отличная команда. Работать с ними одно удовольствие. Заключив с ними договор на комплексное продвижение в сети интернет, мы смогли полностью сосредоточиться на развитии бизнеса. Так как знаем, что наш маркетинг в надежных руках этих хрупких девушек.</p>
        <p><b>Дмитрий Маркус, директор компании ООО Ultra Finance</b></p>
        </blockquote>
        </div>
        <div id="content-container" className="relative z-0 container mx-auto p-10 px-10 m-10 border-36 white112 desc-padding-70-mob-30">
        <AnotherCasesRu />
        <ContactFormRus />
        </div>

</LayoutMainRus>
</>
  );
};

export default CaseUltracashRu;