import * as React from 'react';
import type { Metadata } from "next";
import LayoutMainRus from "@/components/LayoutMainRus";
import ContactFormRus from '@/components/contact-form/ContactFormRus';
import AnotherCasesRu from '@/components/anothercases/AnotherCasesRu';
import FadeInImage from '@/components/anothercases/FadeInImage';
import Image from 'next/image';

export const metadata: Metadata = {
  title: "Создание сайта и продвижение службы такси",
  description: "Кейс по разработке сайта и продвижению службы такси. Работы: маркетинговый аудит, дизайн, создание сайта, UI/UX, SEO на этапе разработки.",
  alternates: {
    canonical: "https://web-machine.rocks/ru/cases/skydrive",
    languages: {
      en: "https://web-machine.rocks/cases/skydrive",
      ru: "https://web-machine.rocks/ru/cases/skydrive",
      uk: "https://web-machine.rocks/uk/cases/skydrive",
    },
  },
};

const CasesSkydriveRu = () => {
  return (
    <>
  <LayoutMainRus>
  <div className="relative z-10 container mx-auto p-10 px-10 m-10 w-100">
        <h1 className={'unbounded'}>Продвижение службы такси или как раскрутить сайт такси?</h1>
        <h4 className={''}>Кейс по разработке сайта и продвижению службы такси. Работы: маркетинговый аудит, дизайн, создание сайта, UI/UX, SEO на этапе разработки.</h4>
       
        <FadeInImage src="/images/portfolio/skydrive/skydrive-01.webp" alt="Создание сайта и продвижение службы такси" />
        <p>На молодой сайт службы такси требовалось привлечение большего количества целевого трафика и увеличение количества заказов, как через формы обратной связи на сайте, так и по телефону. Мы решили вести раскрутку службы такси предварительно подготовив детальный план действий на 8 месяцев работы. </p>
        <h2>Как продвигать службу такси при высокой конкуренции?</h2>
        <p>Было проведено исследование рынка и выявление всех положительных и отрицательных сторон служб такси, принадлежащих компаниям конкурентам. Также были выявлены основные потребности целевой аудитории. На основании этих данных сайт при продвижении службы такси был приведен в соответствующее состояние с добавлением элементов CTA, и ныне выполняет функцию как удобного инструмента для онлайн заказа такси и консультации с оператором call центра, так и сайта визитки службы такси, с подробным описанием тарифов, автомобилей, дополнительных услуг и в целом политики компании. После чего была запущена рекламная кампания в контекстно-медийной сети и начали проводится работы по оптимизации ресурса и улучшению его не только для целевого пользователя, но и для роботов поисковых систем. Кроме того, для привлечения на сайт иностранных пользователей и для увеличения их комфорта при использовании сайта, была разработана англоязычная версия, которая также была подготовлена к продвижению сайта. Как известно, рынок услуг такси высоко-конкурентный и при продвижении службы такси это необходимо учитывать. Поисковая выдача занята сайтами крупных известных компаний, чьи услуги на рынке представлены уже много лет. Как следствие, сайты конкурирующих компаний имеют куда больший возраст, чем ресурс, принадлежащий компании SkyDrive, а следовательно поисковые системы оказывают им больше доверия. Однако возраст сайта — не единственный показатель, влияющий на ранжирование, и специалисты нашей компании очень скрупулезно подошли к проработке всех факторов, имеющих значение как для целевой аудитории, так и для поисковых алгоритмов.</p>
        <h2>Результаты раскрутки сайта такси</h2>
        <p>Уже с первых дней продвижения были заметны впечатляющие результаты — сайт сразу занял высокие позиции в поисковых системах по ключевым запросам, способным привести в компанию целевую аудиторию. Количество посетителей сайта из органической выдачи поисковой системы Google в первые 2 месяца была увеличена на 136,49%. За этот период 64% продвигаемых запросов была выведена в ТОП10, в ТОП3 же вышло порядка 15% ключей. Кроме того, ресурс занял лидирующие позиции в англоязычной выдаче по значительной части продвигаемых англоязычных запросов(в ТОП10 оказалось 25% запросов). По словам клиента, количество заказов ежемесячно увеличивается и, по прогнозам специалистов нашей компании, сайт может выйти на лидирующие позиции по рынку уже в ближайшие пол года.</p>
        <p>Видимость ресурса (сайта) с 11.10.2016 г. к 29.03.2017 г. выросла с 31% до 63% (согласно данным сервиса AllPositions)</p>
        <FadeInImage src="/images/portfolio/skydrive/skydrive-02.webp" alt="Создание сайта и продвижение службы такси" />
        <p>Трафик</p>
        <FadeInImage src="/images/portfolio/skydrive/skydrive-03.webp" alt="Создание сайта и продвижение службы такси" />

        <FadeInImage src="/images/portfolio/skydrive/skydrive-04.webp" alt="Создание сайта и продвижение службы такси" />
        <h2>Реклама службы такси через Adwords</h2>
        <p>Цели и задачи:</p>
        <ul className='spoilerUlStyle'>
            <li>Вывести на 1-2 позицию выдачи по итогам аукциона Google Adwords наиболее приоритетные направления для клиента (Междугороднее такси и Такси Харьков)</li>
            <li>Реорганизовать существующую рекламную кампанию для повышения средней позиции и снижения цены за клик</li>
        </ul>
        <p>Период работ: декабрь 2016</p>
        <h3>Эффективная реклама службы такси - как мы это решали</h3>
        <p>Важная задача состояла в том, чтобы отсеять не релевантный трафик, так как, по желанию клиента, ключевые слова относились к обще-тематическим (такси харьков, заказать такси и т.д.), но предоставляемая услуга была узкой - элитное такси. Изначально был реструктурирован аккаунт, реорганизованы ключевые слова, был проведен A/B тест, для определения наиболее конверсионных словоформ в тексте объявления. Добавлены уточнения, дополнительные ссылки, повышающие вес ключевых слов, а также отображающие выгодные предложения. Для дополнительного описания услуг и преимущества, были добавлены структурированные описания.</p>
        <p>Вёлся постоянный мониторинг средней позиции, цены за клик, своевременное реагирование на повышение ставок конкурентами, расширение списка минус слов</p>
        <p>Стратегия назначения ставок: ручное управление + автоматизированные правила.</p>
        <p>Тип соответствий: комплекс ключевых слов в точном и фразовом соответствии.</p>
        <FadeInImage src="/images/portfolio/skydrive/skydrive-05.webp" alt="Создание сайта и продвижение службы такси" />
        <h3>Результаты рекламных кампаний службы такси</h3>
        <p>Средняя цена за клик составляет 6.05 грн (снижение на 2,32 грн)</p>
        <FadeInImage src="/images/portfolio/skydrive/skydrive-06.webp" alt="Создание сайта и продвижение службы такси" />
        <p>Соотношение “показы-клики” CTR - 17.98% (повышение на 4,77%)</p>
        <FadeInImage src="/images/portfolio/skydrive/skydrive-07.webp" alt="Создание сайта и продвижение службы такси" />
        <p>Средняя позиция 1.8 (понижение на 0.4)</p>
        <FadeInImage src="/images/portfolio/skydrive/skydrive-08.webp" alt="Создание сайта и продвижение службы такси" />
        <p>Снижение средней позиции связано с уменьшением максимальной цены за клик для оптимизации расходов. У ближайшего конкурента средняя позиция составляла 2,4.</p>
        <FadeInImage src="/images/portfolio/skydrive/skydrive-09.webp" alt="Создание сайта и продвижение службы такси" />
        <p>Коэффициент показов в верхнем блоке составил 99,65%</p>
        <FadeInImage src="/images/portfolio/skydrive/skydrive-10.webp" alt="Создание сайта и продвижение службы такси" />
        <p>Проведенные мероприятия по оптимизации привели к ощутимым положительным результатам. По результатам повышения качества объявлений, цена за клик снижена на 2,32 грн, при этом кампания все также опережает ближайших конкурентов по средней позиции.</p>
        <p>Отслеживание звонков, по решению клиента, не производилось, но по его словам, в данный период времени происходило увеличение заказов по направлению такси Харьков, междугороднее такси.</p>
        <h2>Отзыв клиента</h2>
        <blockquote className="blockquote-6">
        <p>Работаю с Веб-машиной уже давно. Ребята большие молодцы, молодой, активный коллектив, профессионалы своего дела! Работы по моему проекту ведутся активно, все время наблюдаю улучшения как в работе сайта, так и в количестве звонков. Отдельное спасибо менеджеру Юленьке за то, что всегда тепло встречает меня в офисе, за постоянные консультации, оперативные ответы на вопросы и просто душевное общение. И так же спасибо Максиму и Валерию за постоянное совершенствование моей рекламной компании. Так держать, желаю вам побольше интересных проектов, хороших и понимающих клиентов!</p>
        <p><b>Николай Чудик, Директор компании - SkyDrive</b></p>
        </blockquote>
        
        
        </div>
        <div id="content-container" className="relative z-0 container mx-auto p-10 px-10 m-10 border-36 white112 desc-padding-70-mob-30">
        <AnotherCasesRu />
        <ContactFormRus />
        </div>

</LayoutMainRus>
</>
  );
};

export default CasesSkydriveRu;