import * as React from 'react';
import type { Metadata } from "next";
import LayoutMainRus from "@/components/LayoutMainRus";
import ContactFormRus from '@/components/contact-form/ContactFormRus';
import AnotherCasesRu from '@/components/anothercases/AnotherCasesRu';
import FadeInImage from '@/components/anothercases/FadeInImage';
import Image from 'next/image';

export const metadata: Metadata = {
  title: "Продвижение магазина электротехники",
  description: "Кейс по раскрутке и продвижению магазина электротехники в Украине LUXEL. Работы: маркетинговый аудит, разработка интернет-магазина, продвижение интернет-магазина, UI/UX.",
  alternates: {
    canonical: "https://web-machine.rocks/ru/cases/luxel",
    languages: {
      en: "https://web-machine.rocks/cases/luxel",
      ru: "https://web-machine.rocks/ru/cases/luxel",
      uk: "https://web-machine.rocks/uk/cases/luxel",
    },
  },
};

const CasesLuxelRu = () => {
  return (
    <>
  <LayoutMainRus>
  <div className="relative z-10 container mx-auto p-10 px-10 m-10 w-100">
        <h1 className={'unbounded'}>Продвижение магазина электротехники</h1>
        <h4 className={''}>Кейс по раскрутке и продвижению магазина электротехники в Украине LUXEL. Работы: маркетинговый аудит, разработка интернет-магазина, продвижение интернет-магазина, UI/UX.</h4>
        <FadeInImage src="/images/portfolio/luxel/luxel-02.webp" alt="Продвижение магазина электротехники" />
        <p>Luxel — стремительно развивающаяся компания, специализирующаяся на производстве электрофурнитуры и энергосберегающих ламп, а также продаже электротехники через магазин. Основной целью компании является внедрение передовых технологических разработок и производство современных изделий в сочетании с приемлемыми ценами, а также налаживание долгосрочных отношений со своими партнерами. Основной задачей при работе с этим Заказчиком стало расширение базы клиентов и налаживание сбытовых цепочек при помощи Интернет коммуникаций, в частности сайта компании. Также требовалось поисковое продвижение магазина электротехники для повышения видимости предложения компании на рынке, как для потенциальных компаний-дилеров, так и для физических лиц с целью повышения узнаваемости бренда и повышения уровня розничных продаж благодаря продвижению магазина электротехники.</p>
        <div style={{background: '#fff', width: '100%', padding: '5%', marginTop: '12px', borderRadius: '36px'}}>
        <div style={{margin: 'auto', display: 'table'}}>
        <Image className="border-12" src='/images/portfolio/luxel/luxel-01.webp' width={500} height={500} alt='Продвижение магазина электротехники'/>
        </div>
        </div>
        <h2>Как мы продвигали магазин электротехники?</h2>
        <p>Продвижение магазина электротехники зачастую связано с высокой конкуренцией в нише ввиду наличия большого количества непрямых конкурентов. Очень часто при раскрутке магазина электротехники Luxel приходилось конкурировать в поисковых системах и с партнерами самой компании и дилерами и представителями других интернет магазинов электротехники в Украине. Для того чтобы максимально правильно выстроить работу по продвижению и раскрутке магазина электротехники нам необходимо было изучить конъюнктуру рынка осветительной техники и электротехники в Украине, понять всех участников рынка и без вреда для репутации компании и отношений с партнерами Luxel провести качественное продвижение сайта электротехники (для B2B) и магазина электротехники (для B2C).</p>
        <p>Для достижения поставленных целей была разработана <b>стратегия интернет-маркетинга</b>, предполагающая следующие основные этапы.</p>
        <p><b>1 этап.</b> Повышение видимости предложения и рост конверсий.</p>
        <p>Основным каналами на данном этапе являются:</p>
        <ul className='spoilerUlStyle'>
            <li>SEO. Основным KPI на данном этапе являются % видимости (совокупность значений позиций в Google), % новых посетителей сайта</li>
            <li>Контент. Работа над улучшением контента на сайте, его постоянное совершенствование и повышение уровня полезности для посетителей.</li>
            <li>Маркетинг. Работа над налаживанием каналов сбыта компании. Удобство предложений на сайте.</li>
        </ul>

        <p><b>2 этап.</b> Повышение представленности предложения на рынке.</p>
        <p>Основным каналами на данном этапе являются:</p>
        <ul className='spoilerUlStyle'>
            <li>SEO. Выстраивание правильного привлечения целевого трафика на сайт. На сайт должны попадать только определенные группы ЦА, а именно представители реселлеров и участники сбытовых каналов распределения</li>
            <li>Маркетинг. Логика заключается в том, чтобы показывать уже привлеченным релеватным целям представителям определенных групп ЦА, конкретизированное предложение с выгодами для них с последующей конвертацией в лиды.</li>
        </ul>

        <p>Всего за время работы над продвижением сайта Заказчик наладил сотрудничество более чем с 18 оптовыми клиентами, которые нашли предложение непосредственно в поисковых системах по целевым фразам. </p>

        <h2>Результаты продвижения магазина электротехники</h2>
        <p>Комплекс мероприятий по продвижению магазина электротехники позволил повысить общую видимость ресурса.</p>
        <p>Показатели видимости сайта в поисковых системах</p>
        <FadeInImage src="/images/portfolio/luxel/luxel-03.webp" alt="Продвижение магазина электротехники" />
        <p>Рост посещаемости магазина электротехники</p>
        <FadeInImage src="/images/portfolio/luxel/luxel-04.webp" alt="Продвижение магазина электротехники" />
        <p>Рост показателей после продвижения магазина электротехники</p>
        <FadeInImage src="/images/portfolio/luxel/luxel-05.webp" alt="Продвижение магазина электротехники" />

        </div>
        <div id="content-container" className="relative z-0 container mx-auto p-10 px-10 m-10 border-36 white112 desc-padding-70-mob-30">
        <AnotherCasesRu />
        <ContactFormRus />
        </div>

</LayoutMainRus>
</>
  );
};

export default CasesLuxelRu;