// utils/dataBlogArticlesRu.tsx
export const blogArticles = [
    {
      id: 1,
      title: 'Раскрутка аккаунта в Behance — продвижение услуг дизайнера',
      slug: 'behance',
      seoTitle: 'Раскрутка аккаунта в Behance — продвижение услуг дизайнера',
      seoDescription: 'Прежде чем рассмотреть вопрос продвижения в Behance, давайте дадим ответ на вопрос: что такое Behance (бихансе) и зачем он нужен? Какую пользу может принести архитектурной или дизайнерской студии? Насколько необходимо продвижение в Behance?',
      canonical: '/ru/blog/behance',
      image: '/images/blog/covers/prodvizhenie-v-behance-1.jpg',
      imageAlt: 'Раскрутка аккаунта в Behance — продвижение услуг дизайнера',
      date: '2017-11-30', // дата публикации
      views: 20967, // начальное количество просмотров
      topics: ['Behance', 'Раскрутка', 'Дизайн'],
      fullText: `
<p>Прежде чем рассмотреть вопрос <a title="Продвижение в сети Интернет" href="/ru/seo">продвижения </a>в Behance, давайте дадим ответ на вопрос: что такое <a title="Платформа Behance" href="https://www.behance.net/" target="_blank" rel="nofollow noopener noreferrer">Behance</a> (бихансе) и зачем он нужен? Какую пользу может принести архитектурной или дизайнерской студии? Насколько необходимо продвижение в Behance?</p>
<p>Итак, </p>
<h2>...зачем продвигаться в Behance?</h2>
<p>Behance — это креативная платформа номер 1 в мире, на которой дизайнеры, и представители творческих профессий могут делиться своими работа, презентовать свои кейсы, оценивать других дизайнеров, и что самое главное — продвигать свои услуги. Целесообразность продвижения в Behance определяется статистикой: по данным на февраль 2018 года в индексе Google находится более 127 млн. страниц, преимущественно с кейсами проектов, ежемесячная аудитория составляет 2,5 млн. посетителей с общим числом просмотров 54 млн. просмотренных страниц в месяц! Значительный процент посетителей сайта — это потенциальные клиенты. Именно этот фактор делает площадку одним из основных каналов привлечения заказчиков в сегменте услуг графики, иллюстраций, <a href="/ru/web-development">создания сайтов</a>, motion дизайна, разработки веб-интерактива, архитектуры, дизайна продуктов, а также дизайна в целом.</p>
<p>По статистическим данным Alexa сайт находится на 463 месте в мире по посещаемости.</p>
<p>54000000 просмотров - Посещаемость Behance (по данным Alexa на 02.2018 г.)</p>
<h2>Предыстория</h2>
<p>До отказа от предоставления услуг дизайна и веб-разработки сайтов мы планировали активное продвижение в Behance, однако наши планы поменялись и мы свернули целом направление, чтобы сфокусироваться на интернет-маркетинге и бросить все силы в рекламу, PR, SEO, крауд и прокачку других скиллов. Однако стратегия и даже тактика остались, и мы готовы поделить нашими наработками.</p>
<p>Для формирования плана маркетинга раскрутки в Behance была проделана большая работа: изучались успешные кейсы по продвижению в Behance как в русскоязычной среде, так и в англоязычной. Причём акцент однозначно делался на американские кейсы, также мы изучали аккаунты с позиции их тактических наработок, типов популярных постов, анализ используемых хэштегов, задействование социальных сетей, их взаимодействие с аудиторий, их действия вне Behance, SMO на их сайтах, вобщем провели стандартный бенчмаркетинг.</p>
<p>За основу брали такие раскрученные аккаунты (более 1 млн. просмотров), как:</p>
<ul class='spoilerUlStyle'>
<li><a href="https://www.behance.net/BramVanhaeren" target="_blank" rel="nofollow noopener noreferrer">Bram Vanhaeren</a> (1 млн. просмотров)</li>
<li><a href="https://www.behance.net/mikecampau" target="_blank" rel="nofollow noopener noreferrer">Mike Campau</a> (3 млн. просмотров)</li>
<li><a href="https://www.behance.net/designerpreis" target="_blank" rel="nofollow noopener noreferrer">Andreas Preis</a> (3,4 млн. просмотров)</li>
<li><a href="https://www.behance.net/endalaust" target="_blank" rel="nofollow noopener noreferrer">Emi Haze</a> (3,7 млн. просмотров)</li>
</ul>
<p>Также предлагаем Вам изучить другие раскрученные аккаунты в Behance, но уже непосредственно в Вашей нише, например, в категории — «Архитектура», или «Дизайн продуктов». Как бы там ни было, успешный опыт презентации своих работ будет полезным для разработки маркетинговой стратегии.</p>
<p>Но самое главное, что Вы должны почерпнуть у этих ребят — это то, как эффективно презентовать Вашу работу и показать её с выгодной стороны!</p>
<p>Пару слов об оформлении кейсов. Продвижение в Behance возможно только при качественно оформленных работах. Поэтому следите за тем, чтобы изображения и их описания были логически последовательными, детализировано отображали процесс создания работы, а на обложке стояла максимально привлекательное изображение. Это будет влиять на CTR то есть кликабельность Ваших работ в общем списке. Также важно указывать всех участников проекта (это увеличит охват просмотров).</p>
<p>На втором этапе мы подытожили имеющийся успешный опыт и сформировали на его основе стратегию интернет-маркетинга.</p>
<p>Теперь по сути.</p>
<h2>Наша стратегия раскрутки в Behance</h2>
<p>Мы выделили 3 основных этапа:</p>
<ol class='spoilerOlStyle'>
<li>оформление и прокачка аккаунта</li>
<li>раскрутка аккаунта Behance</li>
<li>продвижение своих кейсов в Behance</li>
</ol>
<h3>Продвижение в Behance. Этап 1</h3>
<p>В целом его можно охарактеризовать как оформление и прокачка аккаунта. Цель: создать полностью оформленный и заполненный аккаунт компании. Задачи этапа:</p>
<ul class='spoilerUlStyle'>
<li>Создать личный аккаунт дизайнера, а также всех участников Вашей компании. Заполнить по возможности все поля.</li>
<li>Создать группу Вашей студии.</li>
<li>Установить взаимосвязь между сайтом и аккаунтами в Behance: установить ссылку на сайт, и на сайте — например, в футере значок Behance, а также провести SMO на страницах кейсов, уже размещенных на Вашем сайте.</li>
<li>Подписаться на дизайнеров с интересными проектами в Вашей ниши (возможно можно будет что-то подчерпнуть в оформлении кейсов, или аккаунта Behance в целом — разумеется, не самих работ :-)</li>
<li>Добавить несколько имеющихся проектов.</li>
</ul>
<h3>Продвижение в Behance. Этап 2</h3>
<p>Много подписчиков сразу не будет, если конечно модераторы Behance не сочтут добавленные Вами проекты исключительными и сразу не добавят их как избранные в одну из категорий Галерии проекта.</p>
<p>Поэтому, чтобы получить первичное признание на Behance, кроме публикации своих кейсов и работ можно создать серию потенциально востребованных кейсов, а именно: провести редизайн уже существующих брендов.</p>
<p>Данный приём уже неоднократно использовался дизайнерами со всего мира. Например, берём такие известные бренды, как Apple, Microsoft, Starbucks, X-space, Telsa, ну или любой другой, который Вам нравится. И делаем своё виденье их фирменного стиля. Оптимизируем страницы кейсов под брендовые запросы, с акцентом на англоязычных пользователей и вау-ля! Трафик и количество просмотров растёт! Можно пойти ещё дальше, и отправить Ваши работы в отдел маркетинга соответствующих компаний, возможно, они заинтересуются Вашим мастерством!</p>
<p>Часть вторая этапа №2. Это работа с сетью профессионалов-дизайнеров. Активно пишите комментарии, оценивайте другие работы, добавьтесь в сообщество Behance на Facebook, вобщем займите активную позицию и станьте заметной фигурой сообщества!</p>
<h3>Продвижение в Behance. Этап 3</h3>
<p>Допустим, мы уже активный участник сообщества, и у Вас есть не менее 1000 подписчиков и 20000 просмотров.</p>
<p>Настало время продвигать свои лучшие работы!</p>
<h4>Частота публикаций и их содержание</h4>
<p>Публикуйте не более 1 проекта в день, а лучше не чаще 1 проекта в 1-2 недели. Здесь определённо лучше качество, чем количество. Время в перерывах потратьте на доскональную проработку кейсов — изображения должны быть впечатляющими и цепляющими, обращая внимание на детали: шрифты, последовательность слайдов, их описание — всё должно быть идеальным.</p>
<p>Касательно последовательности, то используйте шаблон:</p>
<ol class='spoilerOlStyle'>
<li>Описание самого проекта</li>
<li>Задача, поставленная клиентом</li>
<li>Решение задачи (детально описать процесс решения)</li>
<li>Конечный итог</li>
</ol>
<p>Лучше всего публиковать проекты от лица группы участников, это будет более эффективно в контексте продвижения аккаунта.</p>
<h4>Лидогенерация на Behance</h4>
<p>Не забудьте добавить как в группе, так и на страницах аккаунтов дизайнеров способ связи для отправки брифа на заказ + укажите географию клиентов, с которыми Вы можете работать, лучше всего указать — worldwide.</p>
<p>И помните золотое правило продвижения на Behance — публикуйте только самые лучшие работы!</p>
<p>Список тактических приёмов постоянно дополняется новыми, тем не менее, даже использование перечисленных в нашей статье приёмов позволит Вам значительно повысить представленность и видимость, а значит и интерес к Вашим работам в Бихансе!</p>
<h3>P.S.</h3>
<p>Многие прибегают к помощи платных и бесплатных сервисов, которых в настоящее время уже немало (например, Dribe, BeTop и т.д.), однако это может иметь лишь временный характер и по сути продвижение в Behance сводится к тому, чтобы Вашу работу заметили кураторы и добавили в избранные галереи, в которую попадает менее 1% от всех загруженных работ дизайнеров. Именно это "даёт" тысячи и десятки тысяч просмотров и лайков... Для этого нужно, чтобы Ваша работа:</p>
<ul class='spoilerUlStyle'>
  <li>получила положительный отклик от других авторов (лайки, комментарии)</li>
  <li>проект должен включать в себя 6-20 изображений без повторения</li>
  <li>изображения в высоком разрешении, не менее 1400 пикселей</li>
  <li>никаких водяных знаков</li>
  <li>проект должен быть завершенным (не черновик)</li>
  <li>иметь привлекательную обложку</li>
  <li>была корректно настроена: соответствующая категория, указаны соавторы, группа, инструменты, теги и описание</li>
  <li>а также носила инновационный характер, была качественной, оригинальной и тщательно продуманной - это, пожалуй, самый важный пункт!</li>
  </ul>
<p>Подробнее Вы можете почитать об этом в статье от самих кураторов Беханс: <a href="https://medium.com/behance-blog/behance-curation-philosophy-and-approach-6e0ae9ab350f" target="_blank" rel="nofollow noopener noreferrer">https://medium.com/behance-blog/behance-curation-philosophy-and-approach-6e0ae9ab350f</a></p>
<p>Успехов в продвижении в Behance, увлекательных проектов, которыми можно гордиться и серьёзных клиентов!</p>
<p>Вопрос к дизайнерам и маркетологам дизайн-студий. Как Вы продвигаете свои услуги?</p>   
      `,
    },
    {
      id: 2,
      title: 'Продвижение в Китае. Регистрация сайта в Baidu (Байду, 百度)',
      slug: 'baidu-sign-up',
      seoTitle: 'Продвижение в Китае. Регистрация сайта в Baidu (Байду, 百度)',
      seoDescription: 'Как добавить сайт в Байду? Как зарегистрировать сайт в веб-мастерах Baidu (百度)? ★★★★★ Вторая статья о продвижении бизнеса и интернет-маркетинге в Китае.',
      canonical: '/ru/blog/baidu-sign-up',
      image: '/images/blog/covers/registration-baidu.jpg',
      imageAlt: 'Продвижение в Китае. Регистрация сайта в Baidu (Байду, 百度)',
      date: '2017-10-06',
      views: 12187,
      topics: ['SEO', 'Китай', 'Baidu'],
      fullText: `

<p>При продвижении в Китае необходимо учитывать ряд особенностей. Более подробно об <a href="/ru/blog/chinese-digital-marketing">интернет-маркетинге в Китае</a> я уже писал. Если кратко, то основной поисковой системой Поднебесной является Байду, для продвижения в котором необходимо прежде всего добавить сайт в эту систему. Сделать это возможно через инструмент веб-мастеров. Аналогом Яндекс-вебмастера и Google WebMasters в Китае является Baidy WebMaster (zhanzhang.baidu.com). Регистрация сайта в веб мастерах Байду – это тема данной статьи.</p>
<p>Регистрация в Baidu – Baidy WebMaster (zhanzhang.baidu.com) предполагает базовое знание китайского языка, кучу сложностей и непонятностей, но при большом желании и упорстве это вполне реально.</p>
<br>
<p><img class="border-12" src="/images/blog/china2.jpg" alt="Продвижение сайта в Китае, регистрация в Baidu" width="680" height="1000" /></p>
<br>
<p>Для добавления сайта в веб-мастера Baidu Вам понадобится: аккаунт в Байду (passport.baidu.com), китайский номер телефона (но необязательно, об этом позже), и возможно, аккаунт в QQ и аккаунт в мессенджере WeChat. Даже если при регистрации в Байду и добавлении сайта в веб мастерах Baidu они не потребуются, аккаунты в этих ресурсах пригодится при дальнейшем продвижении сайта в Байду.</p>
<p><img class="border-12" src="/images/blog/baidu-logo.png" alt="Регистрация сайта в Байду, добавление сайта в Baidu" width="1024" height="768" /></p>
<h2>Регистрация аккаунта в Байду</h2>
<br>
<p><img class="border-12" src="/images/blog/passport-baidu-1.jpg" alt="Паспорт Байду" width="1041" height="652" /></p>
<br>
<p>Итак, для начала необходимо зарегистрировать аккаунт в Baidu, как называемый паспорт Байду: <a href="https://passport.baidu.com/v2/?reg" target="_blank" rel="nofollow noopener noreferrer">https://passport.baidu.com/v2/?reg</a></p>
<br>
<p><img class="border-12" src="/images/blog/registracija-passport-baidu.jpg" alt="Регистрация аккаунта в Байду" width="1040" height="638" /></p>
<br>
<p>Однако сложность в данной процедуре возникает с первым же пунктом – необходимо ввести номер телефона материкового Китая. То есть номера Сянгана (Гонконга), Макао, которые можно без особых проблем купить с подключением через IP здесь не подойдут.</p>
<p>К счастью, существует альтернативный способ регистрации аккаунта в Байду на международный номер телефона. Для этого необходимо пройти по ссылке: <a href="https://passport.baidu.com/v2/?reg&amp;u=http://pan.baidu.com&amp;regType=1&amp;tpl=netdisk&amp;overseas=1" target="_blank" rel="nofollow noopener noreferrer">https://passport.baidu.com/v2/?reg&amp;u=http://pan.baidu.com&amp;regType=1&amp;tpl=netdisk&amp;overseas=1</a></p>
<br>
<p><img class="border-12" src="/images/blog/registracija-baidu-internation-number.jpg" alt="Регистрация в Байду на международный номер телефона" width="1072" height="651" /></p>
<br>
<p>Где:</p>

<ul class='spoilerUlStyle'>
<li>手机号 – номер телефона</li>
<li>用户名 – логин пользователя</li>
<li>验证码 – код, который придёт на Ваш номер в течение 24 часов (мне пришёл за 50 сек.)</li>
<li>密码 – пароль к аккаунту</li>
</ul>
<p><label for="TANGRAM__PSP_3__isAgree">阅读并接受</label>《百度用户协议》及《百度隐私权保护声明》– чекбокс, которым Вы подтверждаете согласие с условиями Пользовательского соглашения Baidu и Заявления о конфиденциальности Baidu.</p>
<br>
<p><img class="border-12" src="/images/blog/choise-ukraine.gif" alt="Создание аккаунта в Байду (Baidu) - выбор Украины" width="1030" height="473" /></p>
<br>
<p>В выпадающем окне 手机号 есть и Украина, и Россия, и почти все страны мира. Украина – это 乌克兰 (+380).</p>
<p>После указания номера необходимо будет пройти проверку "я не робот", выглядит это следующим образом.</p>
<br>
<p><img class="border-12" src="/images/blog/checking-robots.gif" alt="Регистрация в Baidu - проверка робота" width="1030" height="522" /></p>
<br>
<p>Далее необходимо ввести код-подтверждение, который придёт на указанный номер в SMS (до 24 часов, на мой телефон код пришёл менее, чем за минуту) и заполнить соответствующие поля логина и пароля.</p>
<p>После этого – успех! У Вас есть свой аккаунт на Байду! Аккаунт Веб-машины выглядит так:</p>
<br>
<p><img class="border-12" src="/images/blog/passport-baidu-2.jpg" alt="Аккаунт Байду после регистрации" width="1293" height="790" /></p>
<br>
<p>На данной стартовой странице Вам предлагают повысить безопасность, выполнив ряд рекомендаций, например, включив аутентификацию по SMS.</p>
<p>Теперь переходим к регистрации сайта в Zhanzhang...</p>
<h2>Подготовка к регистрации сайта в Baidu</h2>
<p>Для регистрации сайта в Байду необходимо иметь аккаунты в QQ и WeChat. т.к. аккаунты в этих китайских социальных сетях могут являются обязательными полями в веб-мастерах Zhanzhang Baidu.</p>
<h3>Регистрация в QQ</h3>
<p>Чтобы зарегистрироваться в QQ необходимо перейти на страницу регистрации на английском (ну или на китайском) языке. Сделать это можно, перейдя по ссылке: <a href="https://ssl.zc.qq.com/v3/index-en.html" target="_blank" rel="nofollow noopener noreferrer">https://ssl.zc.qq.com/v3/index-en.html</a></p>
<br>
<p><img class="border-12" src="/images/blog/registracija-QQ.gif" alt="Регистрация в QQ" width="708" height="679" /></p>
<br>
<p>Далее укажите регистрационные данные и подтвердите номер телефона.</p>
<p>После Вам необходимо будет подтвердить почтовый ящик:</p>
<br>
<p><img class="border-12" src="/images/blog/reg-qq-4.jpg" alt="Подтверждение email при регистрации в QQ" width="499" height="239" /></p>
<br>
<p>Поздравляю, у Вас есть аккаунт в QQ!</p>
<br>
<p><img class="border-12" src="/images/blog/china1.jpg" alt="Регистрация аккаунта в QQ" width="680" height="1000" /></p>
<br>
<h3>Создание аккаунта в WeChat и получение WeChat ID</h3>
<br>
<p><img class="border-12" src="/images/blog/wechat-id.jpg" alt="WeChat ID - регистрация в мессенджере WeChat" width="777" height="632" /></p>
<br>
<p>Ваша задача – получитьWeChat ID. Для этого необходимо:</p>

<ul class='spoilerUlStyle'>
<li>Установить на смартфоне приложение WeChat и открыть его.</li>
<li>Зайти в меню Параметры (Setting).</li>
<li>Перейти в раздел Моя учетная запись (My profile).</li>
<li>Нажать на ссылку WeChat ID.</li>
<li>Ввести данные (разрешается использовать от 6 до 20 символов. Это могут быть буквы, цифры, а также знаки – или _. В начале обязательно ставится буква).</li>
</ul>

<p>Сохраните WeChat ID. Он Вам ещё пригодится!</p>
<h2>Добавление сайта в Байду Веб-мастера Zhanzhang</h2>
<p>Имея аккаунты в QQ и WeChat, а также, главное, аккаунт в Байду можно переходить к регистрации сайта в Байду. Для этого необходимо перейти по ссылке: <a href="http://zhanzhang.baidu.com/site/index" target="_blank" rel="nofollow noopener noreferrer">http://zhanzhang.baidu.com/site/index</a></p>
<p>При первой регистрации аккаунта в Zhanzhang будут необходимы данные WeChat ID и QQ-аккаунт.</p>
<br>
<p><img class="border-12" src="/images/blog/1-registration-baidu.jpg" alt="Регистрация сайта в Байду (первый раз)" width="1000" height="589" /></p>
<br>
<p>В дальнейшем регистрация и добавление других сайтов в вебмастере Байду будет упрощенной:</p>
<br>
<p><img class="border-12" src="/images/blog/adding-website-webmasters.jpg" alt="Добавление сайта в веб-мастера Байду" width="1095" height="713" /></p>
<br>
<p>Регистрация сайта в Baidu происходит в 3 этапа:</p>

<ol class='spoilerOlStyle'>
<li>第一步：输入网站 - ввод сайта</li>
<li>第二步：站点属性 - уточнение данных</li>
<li>第三步：验证网站 - подтверждение и валидация.</li>
</ol>
<p>На первом этапе указывается url-адрес сайта с указанием соединения - http или https.</p>
<p>Далее, указывается тематика продвигаемого Вами сайта.</p>
<br>
<p><img class="border-12" src="/images/blog/registracija-baidu-etap2-a.jpg" alt="Регистрация сайта в Baidu" width="1349" height="648" /></p>
<br>
<p>Затем, необходимо подтвердить права на сайт, например, скачав валидационный файл и загрузив его в корневую директорию сайта.</p>
<br>
<p><img class="border-12" src="/images/blog/registracija-baidu-etap3.jpg" alt="Регистрация в Байду - валидация" width="1351" height="647" /></p>
<br>
<p>После подтверждения файла валидации необходимо пройти аутентификацию по указанному Вами протоколу соединения, обычно, это занимает после чего Ваш сайт будет просканирован поисковым роботом Байду добавлен в индекс.</p>
<br>
<p><img class="border-12" src="/images/blog/registracija-baidu-etap4.jpg" alt="Регистрация в Байду - подтверждение сайта" width="1352" height="643" /></p>
<br>
<p>После этого успех! Вы добавили сайт в Байду, и китайский интернет уже падает в Ваши объятия!</p>
<br>
<p><img class="border-12" src="/images/blog/registration-baidu-uspeh.jpg" alt="Регистрация в Байду прошла успешно!" width="1600" height="900" /></p>
<br>
<p>Что делать дальше? Как продвинуть сайт в Байду? Какие основные факторы ранжирования сайтов в Байду? Ответы на эти вопросы Вы найдёте в следующей статье по теме продвижения в Китае.</p>

<h3>Полезные ссылки:</h3>

<ul class='spoilerUlStyle'>
<li>Сообщество веб-мастеров Байду: <a href="http://bbs.zhanzhang.baidu.com/" rel="nofollow">http://bbs.zhanzhang.baidu.com/</a></li>
<li>Центр обучения и курсы Байду: <a href="http://zhanzhang.baidu.com/college/index" target="_blank" rel="nofollow noopener noreferrer">http://zhanzhang.baidu.com/college/index</a></li>
<li>Панель управления проектами в веб-мастерах Байду: <a href="http://zhanzhang.baidu.com/dashboard/index" target="_blank" rel="nofollow noopener noreferrer">http://zhanzhang.baidu.com/dashboard/index</a></li>
<li>Задать вопрос онлайн в Байду: <a href="https://ikefu.baidu.com/web/zhanzhangpingtai" target="_blank" rel="nofollow noopener noreferrer">https://ikefu.baidu.com/web/zhanzhangpingtai</a></li>
</ul>

<p>Успехов в <a title="Подробнее о SEO продвижении сайтов" href="/ru/seo">SEO продвижении сайтов</a> в Baidu!</p>
      `,
    },
    {
      id: 3,
      title: 'Уровни товара в фундаментальном маркетинге',
      slug: 'product-levels',
      seoTitle: 'Уровни товара в фундаментальном маркетинге',
      seoDescription: 'Уровни разработки товара в маркетинге: теория и практические примеры в контексте интернет-маркетинга.',
      canonical: '/ru/blog/product-levels',
      image: '/images/blog/covers/product-levels.jpg',
      imageAlt: 'Уровни товара в фундаментальном маркетинге',
      date: '2017-11-13',
      views: 500,
      topics: ['Маркетинг', 'Исследования'],
      fullText: `

<p>Разработка стратегии интернет-маркетинга в целом, и концепция <a title="Что такое продвижение сайта и SEO?" href="/ru/seo">продвижения сайта</a> и рекламной кампании должна базироваться на фундаментальном понимании потребностей, которые призван удовлетворять товар, и как следствие, причин и мотивов покупки на различных уровнях сознания.</p>
<h2>Теория уровней товара</h2>
<p>Уровни товара являются частью концепции 4P маркетинг микса, а именно понятия product.</p>
<h3>4P - Product</h3>
<p>Продукт (product) — это все, что может удовлетворить любые потребности (например, предметы, услуги, компании, виды деятельности, идеи, задачи). Как только такому продукту назначается цена и он поступает на рынок, он переходит в категорию товаров.</p>
<p>Поэтому в политэкономии и в теории маркетинга термин «товар» является синонимом термина продукт.</p>
<p>При продвижение любого товара следует исходить их того, что товар или услуга имеют три концептуальных уровня:</p>
    <ol class='spoilerOlStyle'>
      <li>Товар по замыслу</li>
      <li>Товар в реальном исполнении</li>
      <li>Товар с подкреплением</li>
    </ol>
<p>Рассмотрим их подробнее.</p>
<h3>Трехуровневая концепция продукта</h3>
<p>Товар по замыслу — это базовый уровень, на котором кроется ответ на вопрос, что же в действительности приобретает потребитель. Ядро состоит из решения потребностей, их удовлетворения, либо преимуществ, которые получает потребитель с данным продуктом.</p>
<p>Концепция товара по замыслу является основой для разработки товара в реальном исполнении.</p>
<br>
  <p><img class="border-12" src="/images/blog/marketing-urovni-tovara.jpg" alt="Уровни товара в маркетинге" width="1200" height="671" /></p>
  <br>
<p>То же касается товара в реальном исполнении, то его концепция реализуется 5 характеристиками:</p>
    <ul class='spoilerUlStyle'>
      <li>Качество продукта</li>
      <li>Свойства продукта</li>
      <li>Внешнее оформление продукта</li>
      <li>Марочное название продукта</li>
      <li>Упаковка продукта</li>
    </ul>
<p>Тем не менее, для конкурентоспособности товар должен быть подкреплён дополнительными услугами и выгодами. Например, это может быть: подписка на обучение от компании, расширенная техническая поддержка, скидка на сопутствующие товары, пост-гарантийное обслуживание, расширенных функционал, участие в розыгрышах.</p>
<p>И таким образом, товар превращается в реальное рыночное предложение, а не является просто набором характеристик. Учитывая в разработке стратегии продвижения многоуровневый характер критериев потребительских предложений, а также итоговое целостное восприятие товара как набора выгод и решений, удовлетворяющих как базовые потребности, так и предоставляющих дополнительные преимущества, эффективность рекламных кампаний может быть гораздо выше.</p>
<h2>Уровни разработки товара в маркетинге на примерах</h2>
<p>Разберём примеры.</p>
<h3>Пример №1. Бытовой холодильник.</h3>
<p>Для первого примера возьмём холодильник. Покупая холодильник, мы, прежде всего, приобретаем возможность безопасного длительного хранения скоропортящихся продуктов. Удовлетворить эту потребность на рынке можно с помощью бытового холодильника, который предлагает множество производителей в самой различной комплектации с различными характеристиках по различным ценам. Более того, многие из этих предложений подкреплены гарантией и послегарантийным обслуживанием, а также подарками и даже розыгрышами ценных призов.</p>
  <br>
  <p><img class="border-12" src="/images/blog/marketing-urovni-tovara-primer1.jpg" alt="Уровни товара в маркетинге (пример с холодильником)" width="1200" height="671" /></p>
  <br>
<h3>Пример №2. Прохладительный напиток.</h3>
<p>Аналогично дело обстоит с прохладительным напитком.</p>
<p>Покупая напиток, мы, прежде всего, платим деньги за потребность утолить жажду. Стоит заметить, что утолять жажду призвано много предложений, например, минеральная вода, соки, пиво, а также несчётное количество сладких прохладительный газированных напиток, один из которых является напиток со вкусом колы от производителя Coca-Cola, разлитая в ёмкость 0,33 л. Более того, покупая этот конкретный товар, вы получаете возможность получить ценные призы.</p>
  <br>  
<p><img class="border-12" src="/images/blog/marketing-urovni-tovara-primer2.jpg" alt="Уровни товара в маркетинге (пример с coca-cola)" width="1200" height="671" /></p>
  <br>
<p>Все эти примеры являются частью обобщённого подхода, позволяющего выделять причины и мотивацию совершения покупки тех, или иных товаров, для того, чтобы применять понимание этих вопросов при разработке стратегии интернет-маркетинга и разработке рекламных слоганов и призывов (CTA).</p>
      `,
    },
    {
      id: 4,
      title: 'Продвижение сайта в Baidu (Байду): домен, хостинг, SEO в Китае',
      slug: 'baidu-seo',
      seoTitle: 'Продвижение сайта в Baidu (Байду): домен, хостинг, SEO в Китае',
      seoDescription: 'SEO описание для другой статьи',
      canonical: '/ru/blog/baidu-seo',
      image: '/images/blog/covers/seo-baidu.jpg',
      imageAlt: 'Продвижение сайта в Baidu (Байду): домен, хостинг, SEO в Китае',
      date: '2017-10-09',
      views: 500,
      topics: ['SEO', 'Baidu', 'Китай'],
      fullText: `
<p>Продвижение сайтов в Китае и SEO-оптимизация под Байду - это сложный процесс, имеющий множество подводных камней в виде лицензий, хостингов, формата домена, интернет-цензуре, законодательных ограничений для некитайских компаний, ведущих свою деятельность в Китае. <a title="Что такое раскрутка сайта и что она в себя включает?" href="/ru/seo">Раскрутка сайта</a> в Байду должна начинаться с выбора правильного домена, заказа хостинга в Китае (иначе скорость загрузки сайта будет не менее 50 секунд) и оформления лицензии ICP. Далее – регистрация в Байду, сбор и кластеризация семантического ядра, внутренняя оптимизация и формирование ссылочного профиля, настройка контекстной рекламы и прочее. Тем не менее, начнём обзор продвижения сайта в Китае с классических SEO вопросов. ICP и особенности национального SEO оставим на десерт.</p>
<br>
<p><img class="border-12" src="/images/blog/prodvijenie-sajta-v-baudu-seo-kitai.jpg" alt="Продвижение сайта в Байду (Baidu) - SEO в Китае" width="1200" height="801" /></p>
<br>
<h2>Продвижение сайта в Baidu (Байду)</h2>
<p>В прошлой статье (см. <a href="/ru/web-blog/prodvizhenie-v-kitae-registratsiya-sajta-v-baidu-bajdu" target="_blank" rel="noopener noreferrer">регистрация сайта в Baidu</a>) я писал о том, как добавить сайт в веб-мастера Zhanzhang, и будем считать, что "сайт с цифрами" в домене уже добавлен. Переходим к настройке и работе в веб-мастерах.</p>
<p>После добавления сайта необходимо указать новые лицензии ICP в разделе: <a href="http://zhanzhang.baidu.com/property/:" target="_blank" rel="nofollow noopener noreferrer">http://zhanzhang.baidu.com/property/:</a></p>
<br>
<p><img class="border-12" src="/images/blog/adding-icp-license-for-china.gif" alt="Добавление ICP лицензии в веб мастерах Байду" width="1027" height="679" /></p>
<br>
<p>Основная работа в веб-мастерах Байду – находится в разделах:</p>

<ol class='spoilerOlStyle'>
<li>优化与维护 – оптимизация и обслуживание сайта</li>
<li>搜索展现 – вид в поиске Байду</li>
<li>网页抓取 – веб-сканирование</li>
</ol>
<p>Здесь можно сделать следующее: </p>

<ul class='spoilerUlStyle'>
<li>Отправить сайт для сканирования ссылок и страниц: http://zhanzhang.baidu.com/linksubmit/index/</li>
<li>Добавление карты сайта и запрос на ручное удаление ссылок на страницы, которые не должны быть включен в поиск: http://zhanzhang.baidu.com/badlink/index/</li>
<li>Работа со структурированными данными: http://zhanzhang.baidu.com/tools/innerintro/</li>
<li>Анализ внутренних ссылок: http://zhanzhang.baidu.com/inbound/index/</li>
<li>Сканирование сайта на предмет проблем с безопасностью: http://zhanzhang.baidu.com/safe/index/</li>
</ul>

<p>Стоит заметить, что Веб-мастера Байду в целом похожи на аналог от Google. Почему? Потому что скопированы с них...</p>
<p>Подробнее узнать обо всех особенностях работы в Zhanzhang можно в сообщество веб-мастеров: <a href="http://bbs.zhanzhang.baidu.com/" target="_blank" rel="nofollow noopener noreferrer">http://bbs.zhanzhang.baidu.com/</a>.</p>

<h3>Факторы продвижения в Байду</h3>
<p>Важно понимать, что по сути при продвижении в Байду используются те же основные составляющие ранжирования. Разумеется, здесь они имеют ряд особенностей, которые мы рассмотрим позднее.</p>
<p>Факторы ранжирования в Байду:</p>

<ul class='spoilerUlStyle'>
<li>релевантное семантическое ядро</li>
<li>onpage-оптимизация</li>
<li>offpage-оптимизация</li>
<li>скорость загрузки сайта</li>
</ul>
<p>Семантическое ядро можно собрать и в дальнейшем кластеризировать с помощью сервиса: Baidu Index (百度指数)</p>
<br>
<p><img class="border-12" src="/images/blog/keywords-baidu.jpg" alt="Подбор статистики по ключевым словам в Байду" width="1347" height="650" /></p>
<br>
<p>Baidu index <a href="http://index.baidu.com/" target="_blank" rel="nofollow noopener noreferrer">http://index.baidu.com/</a> — сервис поможет проанализировать интересующие вас ключевые слова. Можно узнать насколько запрос популярен по периодам: 7 дней, 30 дней, 90 дней, шесть месяцев, за весь период.</p>
<p>Вот пример данных для запроса Интернет-маркетинг:</p>
<br>
<p><img class="border-12" src="/images/blog/seo-baidu-2.jpg" alt="SEO раскрутка сайтов в Байду - подбор ключевых слов" width="1349" height="647" /></p>
<br>
<p>Можно выбрать диапазон дат для статистики…</p>
<p>Пример для 网络营销 (интернет-маркетинг):</p>
<br>
<p><img class="border-12" src="/images/blog/prodvizhenie-sajta-baidu-peroid.jpg" alt="Продвижение сайта в Байду и SEO в Китае" width="1348" height="647" /></p>
<br>
<p>Единственный минус этой системы, это проверка общих информационных ключей. Для подбора интересующих Вас ключей – проверка платная. То есть, чтобы проверить своих ключевые запросы, необходимо внести деньги на счёт. Поэтому при проверке запроса, например, продвижение китайского бизнеса (推中国生意) Вы получите такое сообщение:</p>
<p><br />关键词 “ 推中国生意 ” 未被收录，如要查看相关数据，您需要购买创建新词的权限。</p>
<p>购买创建新词的权限后，您可以添加自己关注的关键词，添加后百度指数系统将在次日更新数据</p>
<p><br />Суть которого в том, что такая: проверка небесплатна.</p>
<br>
<p><img class="border-12" src="/images/blog/seo-ppc-kitai-1.jpg" alt="Стоимость проверки ключа PPC-SEO Байду" width="1350" height="646" /></p>
<br>
<p>Статистика по 1 ключу стоит до конца года (100 “съемов”) стоит 50 юаней, что составляет почти 200грн.</p>
<br>
<p><img class="border-12" src="/images/blog/timg.jpg" alt="Байду кошелек" width="2245" height="1097" /></p>
<br>
<p><img class="border-12" src="/images/blog/payment-seo-baidu.jpg" alt="Продвижение сайтов в Байду" width="1347" height="650" /></p>
<br>
<p>Предлагают производить оплату с 百度钱包 Байду-кошелька, по-видимому аналога Яндекс-денег.</p>

<h4>SEO алгоритмы Байду</h4>
<p>Что касается работы Baidu и SEO в Китае, то с 2013 года поисковик Байду внедрил алгоритм под названием money plant (绿萝) для борьбы со ссылочным спамом, ссылочными фермами и покупными ссылками. В том же году общий алгоритм дополнился Pomegranate (石榴), который направлен на борьбу с сайтами, перегруженными рекламой и всплывающими баннерами и <span style="text-decoration: line-through;">попами</span> поп-апами.</p>
<p>При SEO-оптимизации страниц следует учесть:</p>

<ul class='spoilerUlStyle'>
<li>Мета-теги Title и description должны быть уникальными;</li>
<li>Теги Keywords учитывается в ранжировании Baidu;</li>
<li>Тег title – до 80 символов;</li>
<li>Тег description – до 200 символов;</li>
<li>Тег keywords – до 200 символов;</li>
<li>Baidu учитывает неактивные ссылки, как активные, поэтому они тоже влияют на ранжирование (ссылки в тексте без тега href);</li>
<li>Частое обновление контента +в продвижении;</li>
<li>Тег canonical имеет значение;</li>
<li>Тег lang zh-cn должен стоять для определения языка страницы.</li>
</ul>

<h3>Хостинг и продвижение сайта в Китае</h3>
<p>Для оптимальной скорости загрузки сайта необходимо, чтобы сайт не блокировался в материковом Китае и располагался на хостинге в Китае. Проверить свой сайт Вы можете в сервисах:</p>

<ul class='spoilerUlStyle'>
<li><a href="https://en.greatfire.org/analyzer" target="_blank" rel="nofollow noopener noreferrer">https://en.greatfire.org/analyzer</a></li>
<li><a href="http://www.greatfirewallofchina.org/" target="_blank" rel="nofollow noopener noreferrer">http://www.greatfirewallofchina.org/</a></li>
</ul>
<p>Если сайт доступен, то напротив названий ключевых городов загорится зеленый знак. При блокировке – красный.</p>
<br>
<p><img class="border-12" src="/images/blog/seo-baidu-not-blocked.jpg" alt="Хостинг в Китае" width="1353" height="649" /></p>
<br>
<p>Скорость загрузки – это самый больной вопрос SEO в Китае. Если сайт не на китайских серверах, то скорость загрузки сайта будет не менее 30 секунд. А столько никто не ждёт...</p>
<br>
<p><img class="border-12" src="/images/blog/checking-pagespeed.jpg" alt="Скорость загрузки сайта - SEO в Байду" width="1348" height="601" /></p>
<br>
<p>Например, по Шанхаю скорость загрузки тестового сайта Веб-машины составила 33,4 секунды.</p>
<h2>Лицензия ICP для продвижения в Китае</h2>
<p>Для того, чтобы работать по продвижению в Байду из-под Великой китайской интернет-стены в виде фаервола он же – проект Золотой щит (金盾工程), необходимо оформить лицензию ICP, представляющую собой специальное разрешение, которое выдаёт Министерством промышленности и информатизации КНР для веб-сайтов, работающих в КНР.</p>
<p>Сайт Министерства: <a href="http://www.miit.gov.cn/" target="_blank" rel="nofollow noopener noreferrer">http://www.miit.gov.cn/</a></p>
<br>
<p><img class="border-12" src="/images/blog/licenzija-icp.jpg" alt="Сайт Министерства информации Китая, выдающего ICP лицензии " width="1206" height="765" /></p>
<br>
<p>Существует 2 типа лицензий, выдаваемых Министерством (中华人民共和国工业和信息化部):</p>

<ul class='spoilerUlStyle'>
<li>ICP лицензия – например, 京ICP证04134739号 – предназначена для коммерческих компаний. Является необходимым условием для ecommerce и платежных операций онлайн.</li>
<li>ICP филинг – например, 京ICP备06786221号 — используется для информационных и некоммерческих сайтов.</li>
</ul>
<br>
<p><img class="border-12" src="/images/blog/prodvijenie-sajta-baidu-kitai-icp.jpg" alt="Продвижение сайта в Китае - пример ICP лицензии" width="1000" height="696" /></p>
<br>
<p>Лицензии, выдаются на уровне провинций. Китайские интернет-провайдеры, согласно Положению о телекоммуникации в КНР (2000 г.) обязуются блокировать сайты, не имеющие данной лицензии. Стоит отметить, что для некитайских компаний получение ICP может быть затруднительно, поэтому оптимальным решением будет обратиться к китайским посредникам.</p>

<h2>Контекстная реклама в Baidu и продвижение в картах</h2>
<br>
<p><img class="border-12" src="/images/blog/e_baidu_com.jpg" alt="Контекстная реклама в Китае" width="1350" height="644" /></p>
<br>
<h4><a href="/ru/ppc">Настройка контекстной рекламы</a> в Байду</h4>
<p>Настройка рекламы в Байду выполняется в рекламной кабинете: <a href="http://e.baidu.com/" target="_blank" rel="nofollow noopener noreferrer">http://e.baidu.com/</a></p>
<p>В любом случае, даже если возникают сложности - существует техподдержка Байду:</p>
<br>
<p><img class="border-12" src="/images/blog/baidu-help.gif" alt="PPC - техподдержка Байду" width="771" height="452" /></p>
<br>
<p>Также, существует множество решений по настройке типов и таргетинга контекстной рекламы:</p>
<br>
<p><img class="border-12" src="/images/blog/ppc-baidu-2.jpg" alt="PPC в Китае" width="1349" height="642" /></p>
<br>
<p>Также есть большое число местных рекламных агентств, работающих с иностранными компаниями.</p>
<br>
<p><img class="border-12" src="/images/blog/seo-baidu-company-2.gif" alt="SEO компании в Китае" width="1214" height="617" /></p>
<br>
<p>Важно отметить, что есть ряд исключительных случаев, в которых обращение к китайским партнёрам неизбежно...</p>
<h4>Байду-карты</h4>
<p>Карты Байду являются аналогом Google карт. Рассмотрим пример для 网络营销 (интернет-маркетинг). В map baidu есть информация по городам. Из мегаполисов материкового Китая лидирует с отрывом Шанхай:</p>
<br>
<p><img class="border-12" src="/images/blog/baidu-map.jpg" alt="Карты Байду" width="1365" height="646" /></p>
<br>
<p>Данные по карточке локал-бизнес:</p>
<br>
<p><img class="border-12" src="/images/blog/baidu-map-2.jpg" alt="Продвижение в Китае" width="1365" height="651" /></p>
<br>
<p>Также можно оставить отзыв – хороший способ для эффективного крауд-маркетинга:</p>
<br>
<p><img class="border-12" src="/images/blog/baidu-map-4.jpg" alt="Крауд-маркетинг в Китае" width="1352" height="646" /></p>
<br>
<p>В рамках Байду карт есть функция просмотра улиц:</p>
<br>
<p><img class="border-12" src="/images/blog/baidu-map-5.jpg" alt="Продвижение в Китае" width="1365" height="647" /></p>
<br>
<p>Продвижение в картах Байду – неотъемлемая часть продвижения в Китае, особенно для крауд-маркетинга.</p>

<h2>Особенности продвижения сайта в Китае</h2>
<br>
<p><img class="border-12" src="/images/blog/prodvizhenie-sajta-baidu-3.jpg" alt="Продвижение сайта в Байду" width="1351" height="648" /></p>
<br>
<p>Продвижение сайта в Китае и в частности в Байду имеет ряд дополнительных особенностей, среди которых:</p>

<h3>Цензура</h3>
<p>Китайский интернет находится под систематическим государственным надзором за содержанием веб-страниц, перепиской, постами. Поэтому следует придерживаться строгих рекомендаций, избегать политических заявлений. Более подробно об интернет-цензуре в Китае можно почитать здесь: <a href="https://ru.wikipedia.org/wiki/%D0%98%D0%BD%D1%82%D0%B5%D1%80%D0%BD%D0%B5%D1%82-%D1%86%D0%B5%D0%BD%D0%B7%D1%83%D1%80%D0%B0_%D0%B2_%D0%9A%D0%B8%D1%82%D0%B0%D0%B9%D1%81%D0%BA%D0%BE%D0%B9_%D0%9D%D0%B0%D1%80%D0%BE%D0%B4%D0%BD%D0%BE%D0%B9_%D0%A0%D0%B5%D1%81%D0%BF%D1%83%D0%B1%D0%BB%D0%B8%D0%BA%D0%B5" target="_blank" rel="nofollow noopener noreferrer">https://ru.wikipedia.org/wiki/Интернет-цензура_в_Китайской_Народной_Республике</a>.</p>
<h3>Уникальность контента</h3>
<p>Уникальность контента при продвижении в Байду также, как и в Google или Яндекс имеет значение, однако Байду крайне неоднозначно определяет первоисточник, и Ваш оригинальный контент может стать не оригинальным и ворованным.</p>

<h3>Предпочтение доменам с цифрами</h3>
<p>В Китае считается крутым доменом не тот, который краткий, не имеет цифр и находится в зоне дат-ком, а тот который включает в себя цифры. Всё дело в том, что произношение цифр кроме чисел имеет дополнительное значение, например, процветание, удача и т.п. Это вопрос престижа.</p>
<p>Убедитесь сами! Вот примеры, сайты по поиску работы:</p>

<ul class='spoilerUlStyle'>
<li><a href="http://www.51job.com/" target="_blank" rel="nofollow noopener noreferrer">http://www.51job.com/</a></li>
<li><a href="http://www.58.com/job/" target="_blank" rel="nofollow noopener noreferrer">http://www.58.com/job/</a></li>
</ul>
<p>Сайт знакомств:</p>
<ul class='spoilerUlStyle'>
<li><a href="http://yuehui.163.com/" target="_blank" rel="nofollow noopener noreferrer">http://yuehui.163.com/</a></li>
</ul>
<p>Новостные порталы:</p>
<ul class='spoilerUlStyle'>
<li><a href="http://news.hao123.com/wangzhi" target="_blank" rel="nofollow noopener noreferrer">http://news.hao123.com/wangzhi</a></li>
<li><a href="http://news.163.com/" target="_blank" rel="nofollow noopener noreferrer">http://news.163.com/</a></li>
</ul>

<p><img class="border-12" src="/images/blog/prodvizhenie-sajta-v-kitae.png" alt="Продвижение сайта в Байду (с учётом провинций Китая)" width="496" height="415" /></p>
<br>
<p>Важной составляющей SEO продвижения сайта в Китае является важность регионального продвижения на уровне провинций. Это касается и семантического ядра, и ссылочного профиля, и продвижения в картах.</p>
<br>
<p><img class="border-12" src="/images/blog/prodvizhenie-sajta-baidu-seo-images.jpg" alt="Продвижение сайта в Китае" width="1352" height="645" /></p>
<br>
<p>Продвижение изображений с помощью тега alt – важно и работает при продвижении в Китае!</p>
<p>Что ж, на этом всё, всем успехов в продвижении в Китае! 再见!</p>
      `,
    },
    {
      id: 5,
      title: 'Определение размера выборки в маркетинговых исследованиях (B2C)',
      slug: 'research-sample-b2c',
      seoTitle: 'Определение размера выборки в маркетинговых исследованиях (B2C)',
      seoDescription: 'Определение размера выборки в маркетинговых исследованиях — это процесс расчёта ряда важных показателей, влияющих на репрезентативность исследования.',
      canonical: '/ru/blog/research-sample-b2c',
      image: '/images/blog/covers/research-sample-b2c.jpg',
      imageAlt: 'Определение размера выборки в маркетинговых исследованиях (B2C)',
      date: '2018-01-15',
      views: 500,
      topics: ['Маркетинг', 'Исследования'],
      fullText: `
<p>В данной статье рассмотрим принципы формирования выборки на потребительских рынках, которая обеспечила достаточный уровень репрезентативности данных.</p>
<p>Разработка стратегии продвижения любой компании, бренда, или продукта всегда должна опираться на объективные данные о рыночной конъюнктуре. Получение такой информации может быть осуществлено путём проведения маркетинговых исследований, которые в свою очередь по типу рынка делятся на исследования потребительских рынков (B2C) и <a title="Проведение b2b-маркетинговых исследований: проблемы и особенности" href="/ru/blog/research-sample-b2b">деловых рынков (B2B)</a>. Любой маркетолог должен уметь рассчитывать репрезентативную — то есть представительную выборку, которая на определенном числе ответов отражала бы общую картину по всей совокупности. По причине значительного различия типов выборок и подходов к их расчёту в B2C и B2B правильно будет рассмотреть их в отдельности.</p>
<p>В данной статье поговорим о выборках на потребительских рынках.</p>
<h2>Типы выборок для потребительского рынка</h2>
<p>В целом выборки делятся на два основных типа:</p>
<ul class='spoilerUlStyle'>
<li>вероятностные</li>
<li>невероятностные</li>
</ul>
<p>Кратко рассмотрим их.</p>
<h3>Случайная выборка и её виды:</h3>
<p>Основана на простом случайном отборе элементов и предполагает общую однородность генеральной совокупности, а также равную вероятность доступности всех элементов исследуемой совокупности. Бывает:</p>
<ul class='spoilerUlStyle'>
<li><strong>Механическая выборка</strong> — выборка, упорядоченная по какому-либо признаку. Первый элемент отбирается случайно, затем, с шагом n отбирается каждый i-ый элемент. Формула для определения размера генеральной совокупности имеет следующий вид: N=n*i.</li>
<li><strong>Стратифицированная выборка</strong> применяется в случае определённой неоднородности генеральной совокупности, которая сегментируется на так называемые страты, в которых отбор осуществляется случайным образом.</li>
<li><strong>Кластерная выборка</strong>: единицами отбора выступают не сами объекты, а кластеры элементов, которые отбираются случайным образом.</li>
</ul>

<h3>Невероятностные выборки</h3>
<p>В некоторых случаях целесообразнее проводить отбор по заранее отобранным критериям, более подробно ниже:</p>
<ul class='spoilerUlStyle'>
<li><strong>Квотная выборка</strong>. Отбираем небольшое количество групп (студенты-мужчины 17-19 лет, 20-22 лет; работающие мужчины 33-35 лет, 50-55 лет). Для каждого сегмента определяется количество элементов.</li>
<li><strong>Стихийная выборка:</strong> в выборку попадают наиболее доступные респонденты. Размер выборки определяется по такому параметру, как активность респондентов. Пример: опрос в конце этой статьи.</li>
<li><strong>Выборка типичных случаев:</strong> в выборку попадают элементы с усредненным для генеральной совокупности значением признака.</li>
</ul>
<p>Более подробно методология формирования выборки изучается в рамках Математической статистики.</p>

<h2>Определение размера выборки</h2>
<p>Для примера возьмём случайную выборку. Какой размер выборки необходим для проведения опроса всех жителей Украины старше 18 лет? 1%? 10%? 100%?</p>
<p>Если мы возьмём выборку размером 10%, то это будет означать, что нам потребуется опросить более 3,6 млн респондентов!</p>
<p>На самом деле значение имеет не процентное соотношение выборки к количеству населения, а её абсолютное значение. Главным принципом успешности в данном случае является однородность всего населения.</p>
<p>Итак, перед тем, как определить размер выборки необходимо определить допустимый размер погрешности.</p>
<h3>Погрешности при работе с выборкой</h3>
<p>Важнейшим критерием для расчёта случайной выборки является именно размер выборки, необходимый для получения точного результата, а не размер общей совокупности населения, попадающего под критерии целевой аудитории.</p>
<br>
<p><img class="border-12" src="/images/blog/vyborka-v-b2c-georgia.jpg" alt="Размер выборки для определения предпочтений соусов к мясу" width="1140" height="679" /></p>
<br>
<p>Например, нет никакой принципиальной разницы, изучаем ли мы предпочтения в соусах для мясных блюд в такой относительно небольшой стране, как Грузия, или например, в такой огромной стране, как Китай с населением более миллиарда! Кстати, есть интересная статья об <a title="Об интернет-маркетинге в Китае" href="/ru/blog/chinese-digital-marketing">интернет-маркетинге в Китае</a>. Случайная выборка из 1000 человек в каждом случае будет давать точный ответ с погрешностью + / - 3,2%.</p>
<p>Изменчивость ответов и размера выборки представлена на графике ниже:</p>
<br>
<p><img class="border-12" src="/images/blog/razmer-vyborki-v-marketingovyh-issledovanijah-b2c.jpg" alt="Определение погрешности в выборке для потребительского рынка в маркетинговых исследованиях" width="1140" height="638" /></p>
<br>
<p>Также, для определения размера выборки важно распределение ответов. Наихудшим сценарием является 50 на 50, когда совершенно сложно предсказать ответы респондентов, в том время как наилучшим является 100%. Примером распределения является ситуация, когда 500 респондентов дали один и тот же ответ. Это означает, что с высокой вероятностью опрос 501-го респондента даст тот же ответ. И наоборот, когда из 500 респондентов ответы распределились 250 на 250. При формировании маркетинговых исследований дефолным (то есть по-умолчанию) значением берётся значение 50/50.</p>
<p>Более наглядно информация по определения размера выборки представлена на таблице:</p>
<br>
<p><img class="border-12" src="/images/blog/tablica-razmera-vyborki-v-b2c.jpg" alt="Таблица соотношения погрешности с размером выборки и распределением ответов" width="926" height="476" /></p>
<br>
<p>Также, можно воспользоваться следующей формулой (в ней появляется дополнительные параметр значения дисперсии признака, по которому рассчитывается репрезентативность выборки в генеральной совокупности):</p>
<p>n = t<sup>2</sup> d<sup>2</sup> N / (N D<sup>2</sup>+ t<sup>2</sup> d<sup>2</sup>),</p>
<ul class='spoilerUlStyle'>
<li>где n — объём выборочной совокупности;</li>
<li>N — объем генеральной совокупности;</li>
<li>t — коэффициент нормированного отклонения;</li>
<li>D — допустимая ошибка (обычно в социологических и маркетинговых исследованиях ±5%);</li>
<li>d — значение дисперсии.</li>
</ul>
<p>К счастью, совсем необязательно делать расчёт размера выборки вручную — в настоящее время время существуют специализированные программные, делающие все вычисления автоматически. Тем не менее важно понимать сами принципы этих расчётов.</p>
<p>Итак, для определения размера выборки необходимо:</p>
 <ol class='spoilerOlStyle'>
<li>определить размер генеральной совокупности</li>
<li>определить коэффициент нормированного отклонения и размер допустимой ошибки (по таблице).</li>
</ol>
<p>На выходе Вы получаете размер аудитории, которую необходимо опросить, для получения достоверных данных о всей совокупности, и в дальнейшем применить эти данные для разработки стратегии продвижения на рынке.</p>
<p>Успехов в определении размера выборки и проведении маркетинговых исследований!</p>
      `,
    },
    {
      id: 6,
      title: 'Что такое рейтинг Alexa и правильное его использование в SEO',
      slug: 'what-is-alexa',
      seoTitle: 'Что такое рейтинг Alexa и правильное его использование в SEO',
      seoDescription: 'Что такое рейтинг Alexa и правильное его использование в SEO? — Рейтинг Alexa — это один из самых популярных (но, безусловно, не самый лучший) инструмент интернет-маркетинга. С Alexa.com вы можете проверить популярность сайта, измерить успешность поисковой оптимизации. ',
      canonical: '/ru/blog/what-is-alexa',
      image: '/images/blog/covers/what-is-alexa.jpg',
      imageAlt: 'Что такое рейтинг Alexa и правильное его использование в SEO',
      date: '2018-05-01',
      views: 500,
      topics: ['SEO', 'Продвижение', 'Оптимизация'],
      fullText: `
<p>Для верного восприятия данной статьи мы поделим ее на несколько важных подпунктов:</p>
<ul class='spoilerUlStyle'>
<li>Что такое этот рейтинг Alexa?</li>
<li>Зачем нужен Alexa Rank?</li>
<li>Что же влияет на данный рейтинг и как оценивается Alexa Ranks?</li>
<li>Как оценивается Alexa Ranks?</li>
<li>Какие недостатки?</li>
<li>Краткое заключение.</li>
</ul>
<p>Итак, начнем по порядку: Alexa Internet (<a href="https://www.alexa.com" target="_blank" rel="nofollow noopener noreferrer">https://www.alexa.com</a>) — сайт, на котором собрана статистика посещаемости всех веб-страниц в интернете. По данным Википедии в 2013 году на сайте alexa.com была предоставлена информация о глобальном рейтинге, данные по трафику и другая информация на более 30 (вот здесь внимательно!) МИЛЛИОНОВ веб-сайтов. Посещения самого же сайта компании насчитывает более 4 миллионов человек (и это в месяц).</p>
<p>Изначально сайт alexa.com — это всего лишь панель инструментов (так называемый Toolbar), который для каждого посещаемого сайта показывал важную информацию (такую как количество страниц ресурса, на кого зарегистрирован, частота его обновлений, и многое другое).</p>
<br>
<p><img class="border-12" src="/images/blog/alexa3.png" alt="Что такое рейтинг Alexa и правильное его использование в SEO" width="647" height="373" /></p>
<br>

<h2>Зачем нужен Alexa Rank?</h2>
 <ol class='spoilerOlStyle'>
<li>Примерно оценивать трафик на сайте;</li>
<li>Дать оценку авторитетность сайта (если бы не было PageRank и ТИЦ, то Alexa оказался самым оптимальным показателем);</li>
<li>Проанализировать конкурентов, например можно понять самые популярные ключевые слова, по которым пользователи заходят на сайт конкурента.</li>
</ol>
<h2>Что же влияет на данный рейтинг и как оценивается Alexa Ranks?</h2>
<ul class='spoilerUlStyle'>
<li><strong>Число посетителей</strong> (Reach) - количество пользователей, которые посетили определенный сайт в течении 1 дня;</li>
<li><strong>Количество просмотренных страниц</strong> (Page Views) - количество просмотра страниц пользователями;</li>
</ul>

<h2>Как оценивается Alexa Ranks?</h2>
<p>Согласно официальной странице Наши данные на сайте Alexa, рейтинг рассчитывается с использованием «комбинации» оцененных среднесуточных уникальных посетителей сайта и предполагаемого количества просмотров страниц на сайте за последние 3 месяца. Сайты с самым высоким сочетание уникальных посетителей и просмотров страниц, считаются лучшими в сети Интернет. Данные собираются из подмножества пользователей Интернета, используя одно из 25 000 расширений браузера для Google Chrome, Firefox или IE. Затем алгоритм корректирует различные потенциальные отклонения нормализует данные, основанные на географическом расположении посетителей. Ранг трафика обновляется ежедневно, что делает его довольно точным.</p>
<br>
<p><img class="border-12" src="/images/blog/alexa2.jpg" alt="Что такое рейтинг Alexa и правильное его использование в SEO" width="1139" height="637" /></p>
<br>
<p>Если вы открываете одну страницу несколько раз в течение дня, система будет считать ее за единственное посещение страницы. Другими словами, вы не сможете щелкнуть одну и ту же страницу несколько раз и тем самым увеличить количество просмотров. Это отличный способ предотвратить искусственное повышение статистики. Тем не менее, посетитель может напрямую улучшить онлайн-рейтинг, если он посещает разные страницы.<br />Другими словами, сайты с наивысшим рейтингом не только могут привлекать новых пользователей, но также иметь качественный контент, который способен удерживать людей на сайте.</p>

<h2>Недостатки Alexa</h2>
<p>И ведь на секунду можно было задуматься, что рейтинг Alexa это просто отличный инструмент для оценки качества сайта, но это ошибочное мнение и вот почему. Alexa не может собирать свои данные у всех (очевидно, просто не имеют доступа ко всем пользователям сети Интернет) - они могут собирать данные только из несколько миллионов пользователей через определенные расширения браузера (как упоминалось ранее). Ведь мы прекрасно понимаем, что среднестатистический пользователь вряд ли установит себе какие-либо расширения для браузера и спокойно, без всяких проблем путешествует по разным сайтам.</p>
<p>Многие веб-мастера, имеющие доступ к достоверным данным веб-аналитики для более чем одного веб-сайта, часто сообщают о тенденциях и статистике веб-трафика, которые, как оказывается, полностью не совпадает с соответствующим рейтингом Alexa для каждого сайта.</p>

<h2>Заключение</h2>
<p>Рейтинг Alexa — это один из самых популярных (но, безусловно, не самый лучший) инструмент <a title="Подробнее об интернет-маркетинге" href="/ru">интернет-маркетинга</a>. С Alexa.com вы можете проверить популярность сайта, измерить успешность <a title="SEO продвижение сайта" href="/ru/seo">поисковой оптимизации</a>. Но мой совет — просто придерживайтесь данных Google Analytics, а не приписывайте какое-либо значительное значение сайту www.alexa.com. Однако, анализируя сайты конкурентов, непременно загляните в их рейтинг Alexa Rank, чтобы получить очень грубое представление о том, насколько популярны их веб-сайты по сравнению с вашими. Но я определенно не стал бы думать, что какой-то конкретный веб-сайт получает больше трафика, чем другой, только на том основании, что его рейтинг Alexa Rank находится всего на несколько тысяч ниже.</p>
<p>Имейте в виду, что точность имеет решающее значение для оптимизации поисковых систем, и Alexa не может удовлетворить требования экспертов SEO. В конце концов, есть намного лучшие инструменты для оценки трафика и взаимодействия с пользователем.</p>
<p>Автор статьи: Станислав Янжула.</p>
      `,
    },
    {
      id: 7,
      title: 'Интернет маркетинг в Китае',
      slug: 'chinese-digital-marketing',
      seoTitle: 'Интернет маркетинг в Китае',
      seoDescription: 'Обзор интернет-маркетинга в Китае: положение дел, крупнейшие игроки, перспективы.',
      canonical: '/ru/blog/chinese-digital-marketing',
      image: '/images/blog/covers/chinese-digital-marketing.jpg',
      imageAlt: 'Интернет маркетинг в Китае',
      date: '2014-07-02',
      views: 500,
      topics: ['Маркетинг', 'Baidu', 'Китай'],
      fullText: `
<h2>Интернет маркетинг по-китайски.</h2>
<p>Восток всегда отличался от Запада. Почти во всем – начиная от столовых приборов и заканчивая философией жизни. Исключением не стало и интернет пространство.</span></p>
<p>Поговорим о Поднебесной.</p>
<br>
<p><img class="border-12" src="/images/blog/greatwallchina-min.jpg" alt="продвижение сайтов в Байду" width="1170" /></p>
<br>
<h2>Восток дело тонкое…</h2>
<p>Текущее число пользователей сети интернет в Китае составляет 485 млн. человек, и по прогнозам, в 2015 году составит более 650 млн.! Причин роста много, среди основных можно отметить бум мобильных устройств с доступом к Веб и, конечно же, стабильно продолжающийся последние (!) 30 лет рост ВВП, по которому Китай - 2-я экономика мира! Как отмечает Джефф Вейнер (СЕО LinkedIn) в своём блоге, только за последние 5 лет было создано больше 50 млн. рабочих мест, и это только в городах. Важно отметить, что правительством всячески поощряется импорт технологий, особенно в сфере разработки программного обеспечения, телекоммуникаций и биотехнологий, вобщем всякую перспективную высокотехнологичную всячину. Да. Ещё очень хорошо, когда студенты КНР поступают в зарубежные ВУЗы, что помогает, тем самым, перенимать лучший опыт со всего мира.</p>
<p>Также отличается и <strong>китайский рынок интернет рекламы</strong>, например, более предпочтительна медийная реклама по принципу оплаты показов, чем уже ставшая нормой на Западе система PPC (оплата за переход). Отличает медийную рекламу и то, что её стоимость значительно ниже, а аудитория характеризуется, как профессиональная и молодая.</p>
<p>Основными <strong>интернет-порталами</strong>, на которых сосредоточены наибольшие объемы трафика и соответственно наивысшие доходы от рекламы включают в себя:</p>
    <ul class='spoilerUlStyle'>
      <li>сервис микроблогов – Sina.com и Tianya.com</li>
      <li>многофункциональный портал – Sohu.com (предлагает услуги рекламы, поисковые услуги (в том числе услуги продвижения и раскрутки), а также позиционируется, как портал онлайн игр. Также был монополистом на освещение событий Олимпийских игр, что, как неудивительно, обеспечило хороший подъём компании)</li>
      <li>почтовый сервис – 163.com</li>
      <li>сервис мгновенного обмена сообщениями –QQ.com</li>
      <li>гигант онлайн торговли Alibaba из города Ханчжоу (хорошая площадка для продвижения и раскрутки услуг и товаров)</li>
      <li>Made-in-China.com, который является ведущей платформой электронного бизнеса (B2B) в мире!</li>
      <li>поисковые системы 360.cn (So.com) и Sohou.com</li>
      <li>порталы для локализации, например, для продвижения в определённых городах - Hao12.com и www.2345.com</li>
      <li>Прочие многофункциональные порталы новостей, почты, микроблогов, поиска и рекламы: online.sh.cn, tom.com, 21cn.com.</li>
    </ul>
<p>Одним словом, 您好!</p>
<br>
<p><img class="border-12" src="/images/blog/internet-marketing-china-min.jpg" alt="Интернет-маркетинг в Китае, бизнес с Китаем" width="1170" /></p>
<br>
<h2>Забайдить поисковый трафик</h2>
<p>Самым популярным поисковиком в Китае, а по совместительству и самым посещаемым является – Baidu.com. В настоящее время по объемам обрабатываемых поисковых запросов (а именно: 3 млрд 428 млн., что в глобальном поиске составляет 5,2%) Байду стоит на 3 месте в мире! (согласно данным Википедии: ru.wikipedia.org/wiki/Baidu).</span></p>
<p>К слову о Википедии. Поисковый гигант Байду создал ей проект-аналог – Байдупедию, которая по количеству статей на китайском языке уже давно обошла старую добрую Вики и в настоящее время содержит более 3500000 статей.</p>
<h2>Видные игроки социального толка</h2>
<p>Таких видных мировых игроков социальных и поисковых систем, как Google, Twitter, Facebook, LinkedIN и Youtube в привычном для нас понимании нет. Причина кроется в жесткой цензуре, которая ограничивает политику конфиденциальности. Пожалуй, одним из исключений должен стать LinkedIn. Новость, датируемая мартом этого года, гласит, что эта социальная сеть профессионалов решила вопреки тому, что ей придется пожертвовать сохранностью личных данных пользователей, таки выйти на рынок Китая. Якобы отказ от этого ограничит возможности специалистов общаться и обмениваться опытом. Хочу напомнить, что пока в самом Китае функционирует аналоги LinkedIn – Ushi и Tianji.</p>
<p>Другие эквиваленты западных сетей:</p>
    <ul class='spoilerUlStyle'>
      <li>Sina Weibo - это Twitter/X</li>
      <li>Renren/Kaixin001 - Facebook</li>
      <li>Youku = Youtube.</li>
    </ul>
<p>Такие дела…</p>
<br>
<p><img class="border-12" src="/images/Blog/baidu-serp-min.jpg" alt="интернет-магазины в Китае" width="1170" /></p>
<br>
<h2>Сухой остаток</h2>
<p>Несмотря на всю загадочность и все сложности понимания и организации комплексного интернет-маркетинга в Поднебесной, интернет-пространство Китая является чрезвычайно интересным с точки зрения маркетинга и услуг <a href="/ru/seo" rel="alternate">раскрутки сайтов</a>. Здесь осваиваются новые принципы онлайн продаж и коммуникаций, новые стратегии и тактические решения! Ну если, конечно же, не брать в расчёт копирование крупнейших западных проектов и ресурсов. Пусть даже все это пространство и маркетинговые эксперименты находятся под чутким присмотром властей Срединного Государства. Тем не менее, факт: по данным компании McKinsey & Company ежегодно китайский рынок e-commerce удваивается. Вот такой у них потенциал… Однако, 再见 (zàijiàn)!</p>
<br>
      `,
    },
    {
      id: 8,
      title: 'Что такое PBN и как они используются?',
      slug: 'what-is-pbn',
      seoTitle: 'Что такое PBN и как они используются?',
      seoDescription: 'PBN - сеть веб-сайтов, которую используют для организации подконтрольной ссылочной массы сайта-акцептора с целью повышения позиции сайта в целом и улучшения ранжирования в поисковой системе.',
      canonical: '/ru/blog/what-is-pbn',
      image: '/images/blog/covers/what-is-pbn.png',
      imageAlt: 'Что такое PBN и как они используются?',
      date: '2018-11-24',
      views: 500,
      topics: ['SEO', 'Продвижение', 'Оптимизация'],
      fullText: `
      <hr id="system-readmore" />
<p><em>PBN - сеть веб-сайтов, которую используют для организации подконтрольной ссылочной массы сайта-акцептора с целью повышения позиции сайта в целом и улучшения ранжирования в поисковой системе.</em></p>
<p>В основе своей структуры сеть может иметь множество видов, самый просто вариант выглядит наглядным образом так:</p>
<br>
<p><img class="border-12" title="Что такое PBN и как они используются?" src="/images/blog/chto-takoe-pbn.png" alt="Что такое PBN и как они используются?" /></p>
<br>
<p>PBNS означает PBN Site, ссылаясь на веб-сайт, который является частью частной сети блога.</p>
<p>Однако важной деталью является то, что каждый из отдельных доноров сети PBN никак не связаны друг с другом. Основополагающей идеей частной сети блога заключается в том, что сайты для поисковой системы не связаны между собой, что дает возможность создать естественный профиль ссылочной массы (исходя из корректно составленного анкор листа и стратегии внешнего <a href="/ru/seo">продвижения сайта</a> в целом).</p>
<h2>Основная причина получения бана от Google за использование сети PBN.</h2>
<p>В рамках результатов органической выдачи данные сайты являются наихудшим источником информации, так как не несут актуальной и полезных сведений для конечного пользователя. Что в последствии противоречит принципам и алгоритмам ранжирования в поисковой системы Google.</p>
<br>
<p><img class="border-12" title="использование сети PBN " src="/images/blog/chto-takoe-pbn-1-.png" alt="использование сети PBN " /></p>
<br>
<h3>Почему это работает?</h3>
<p>Поисковые системы имеют множество факторов оказывающих влияние на ранжирования сайта, например:</p>
    <ul class='spoilerUlStyle'>
      <li>уникальный и полезный контент;</li>
      <li>функционал сайта в зависимости от тематики и много другое.</li>
    </ul>
<p>Ссылки имеют наиболее высокий приоритет как фактор ранжирования для поисковой системы, после проведенных работ в общем (технической оптимизации сайта, также работа с контентной частью).</p>
<p>Стратегия считается эффективной, так сайты, которые образуют сеть PBN, является для поисковой системы Google авторитетной. В следствии использования правильно подобранных доноров, вы получаете ссылки с ресурса который обладает доверием и авторитетностью со стороны оценки поисковой системы.</p>
<p>Из многих плюсов сетки PBN можно отнести, контроль за основными показателями донора например: спамость, который негативно влияет на доверие со стороны поисковой системы. В итоге вы получаете ссылки с популярного сайта, согласно алгоритму Google.</p>
<h2>Основные показатели подбора дропа для будущего PBN</h2>
<p>Для измерения качества домена используются 4 основных показателя. Вы можете использовать их все сразу, но, в частности, достаточно 2-х.</p>
<h3>Показатели качества:</h3>
    <ol class='spoilerOlStyle'>
        <li><strong>DA</strong> - domain authority от Moz.com (измеряет, насколько авторитетным является домен, на основе ссылок на него и многих факторов);</li>
        <li><strong>PA</strong> – page authority от Moz.com (оценивает, насколько авторитетной является одна страница на сайте, на основе ссылок. На это также влияет DA сайта в целом) ;</li>
        <li><strong>TF</strong> – trust factor от Majestic.com (измеряет достоверность и авторитет ссылок на сайты);</li>
        <li><strong>CF</strong> - citation Flow от Majestic.com (измеряет, насколько мощными являются ссылки на веб-сайт).</li>
    </ol>
<h2>Краткая инструкция по поиску доноров для PBN:</h2>
<p>Общие рекомендации:</p>
<ul>
<li>DA - 18 +</li>
<li>TF - 13 +</li>
<li>CF - 15+</li>
</ul>
<p>Эти показатели указываю на потенциал домена, при этом необходимо учитывать еще несколько нюансов, которые нужно предварительно проверить перед его покупкой:</p>
    <ul class='spoilerUlStyle'>
      <li>Ссылочную массу домена - показатель, которые указывает на количество веб-сайтов, которые ссылаются на выбранный дроп. Все, что выше 30, будет достаточным показателем.</li>
      <li>Обратные ссылки - это количество ссылок на веб-сайт. В обязательном порядке необходимо проверить их перед покупкой домена. Так как качество также оказывает влияние на основные показатели сайта.</li>
      <li>Anchor Text - просмотрите, имеет ли дроп бренд<em> (что нормально)</em>, избегайте тех, которые обладают: целевые ключи, имеют ли фирменные наименования, которые чаще всего связаны с продажей поддельных товаров и другими очевидных вещей, такими как казино или тематики для взрослых.</li>
    </ul>
<p>Основной набор инструментов для проверки показателей:</p>
    <ul class='spoilerUlStyle'>
      <li>Open Site Explorer - проверка DA &amp; PA;</li>
      <li>Bulk DA Checker - проверка DA;</li>
      <li>Majestic - Check TF, CF, ссылающиеся домены, обратные ссылки и анкоры ссылок;</li>
      <li>Ahrefs - имеет самый большой индекс живых обратных ссылок, рекомендуется как самый надежный.</li>
    </ul>
<p>При всем вышесказанном верным решением будет учесть то, как считает поисковая система Google. А не то что указывает Мажестик, Моз и Ахрефс или какой-либо иной чекер. С момента, как Google прекратил обновление Page Rank, невозможно точно узнать, как именно поисковая система измеряет качество доменов.</p>
<p>На первом этапе необходимо ориентироваться на вышеупомянутые показатели. Они являются не идеальными, но информация о них основана на теории того, что Google считает важным. В других случаях это позволит провести глубокий анализ потенциального донора для принятия решения о покупке.</p>
<p>Самое главное и основное правило — это то, что вы вручную проверяете обратные ссылки. Если будет выявлен факт проставления обратных ссылок с использованием инструментов автоматизации построения ссылок, китайскими анкорами, сотнями и более комментариями в блогах, источником основной массы являются доски, каталоги и т.д. – то данный донор нам не подходит.</p>
<p>Автор — Игорь Лублянский (Middle SEO специалист).</p>
      `,
    },
    {
      id: 9,
      title: 'PR в B2B сегменте. Продвижение B2B-компаний',
      slug: 'pr-b2b',
      seoTitle: 'PR в B2B сегменте. Продвижение B2B-компаний',
      seoDescription: 'PR в B2B ★★★★★ Большинство известных PR-кампаний являются ориентированными на широкие массы потребителей, тогда как PR в B2B — это работа другого формата, характеризующаяся особенностями сферы работы сегмента business-to-business.',
      canonical: '/ru/blog/pr-b2b',
      image: '/images/blog/covers/pr-b2b.jpg',
      imageAlt: 'PR в B2B сегменте. Продвижение B2B-компаний',
      date: '2018-02-01',
      views: 500,
      topics: ['Маркетинг', 'Исследования'],
      fullText: `
      <br>
<p><img class="border-12" style="background: #000;" src="/images/blog/pr-b2b-kompaniy.png" alt="PR в B2B сегменте. Продвижение B2B-компаний" width="800" height="594" /></p>
<br>
<p>Большинство известных PR-кампаний являются ориентированными на широкие массы потребителей, тогда как <span style="text-decoration: underline;">PR в B2B</span> — это работа другого формата, характеризующаяся особенностями сферы работы сегмента business-to-business.</p>

<p>Я изучала множество PR-акций и PR-компаний, в том числе 62 самые успешные кампании (благодарность книге Самые успешные PR-кампании в мировой практике из серии Современные консалтинговые технологии), но подавляющее большинство PR кампаний касались массового потребителя и B2C-рынков. Здесь поле для творчества практически безгранично! Фан-клубы, ТВ, ролики, инфоповоды... Но вот, что делать, когда Ваша целевая аудитория не столько эмоциональна и критерии принятия решений находятся в плоскости не одного индивидуума, или <span style="text-decoration: line-through;">семейного совета</span> домохозяйства, а целых структурных подразделений компании?</p>

<h2>PR B2B vs PR B2C</h2>
<p>Предлагаю тезисно определить основные отличия <a title="Продвижение бизнеса с помощью продвижения сайта и SEO оптимизации." href="/ru/seo">продвижения</a> в B2B от PR в B2C.</p>
    <ul class='spoilerUlStyle'>
      <li>Целевая аудитория PR в B2C — конечный потребитель / домохозяйство, в то время как PR на деловых рынках — <strong>это определенные компании</strong> (относящиеся к определенной специализированной или географической нише, либо определенного размера, либо просегментированные по какому-либо другому признаку), также это могут быть определенные должностные лица внутри этих компаний, руководители, топ-менеджмент, прочие лица принимающие решение (ЛПР), а также любые другие субъекты предпринимательской и бизнес-активности, заинтересованных в Вашем продукте.</li>
      <li>Продвижение в сегменте B2B основано на коммуникации между ЛПР и их личных связях.</li>
      <li>Деловая репутация (гудвил), наличие положительных отзывов и рекомендаций от других компаний в B2B является определяющим фактором.</li>
      <li>Эмоциональные и спонтанные решения для деловой сферы крайне редкое явление, так как клиенты в B2B нацелены на <strong>получение экономических выгод</strong>.</li>
    </ul>
<p>Разумеется, этот список можно продолжать почти бесконечно, так как разница между отдельным человеком и организацией, а также характером потребления очевидна!</p>
<br>
<p><img class="border-12" src="/images/blog/pr-v-b2b-segmente.jpg" alt="PR в B2B-сегменте" width="1139" height="637" /></p>
<br>
<h2>Система PR в B2B-сегменте</h2>
<p>Как же организовать PR в B2B-сегменте?</p>
    <ol class='spoilerOlStyle'>
      <li>Необходимо чётко определить целевую аудиторию. <strong>Максимально чётко</strong>. Вплоть до целевых портретов. Установить обстоятельства, при которых ЦА принимает те или иные интересующие Вас решения. Например, о выборе подрядчика на автоматизацию торговли. Какие отделы принимают участие в обсуждении? Какие аргументы приводят? За кем последнее слово? Изучить что важно для таких специалистов и для таких компаний в целом?</li>
      <li>На основе всего этого составить стратегию продвижения, которая включала бы в себя:</li>
        <li><ol class='spoilerOlStyle'>
        <li>— этапы, очерченные KPI и целями;</li>
        <li>— инструменты воздействия и коммуникации с целевой аудиторией;</li>
        <li>— размер необходимых финансовых инвестиций в маркетинг.</li>
        </ol></li>
      <li>Более детально в рамках каждого из этапов проработать тактические шаги. Например, составить календарь отраслевых мероприятий, конференций, на которых будет ЦА. И как минимум там побывать, <strong>а лучше поучаствовать</strong> в формате спикера с презентацией Вашего продукта. Получить премии, участвовать в отраслевых рейтингах, создать что-то полезное для ЦА, пригласить их на собственное мероприятие, получить рекомендации от текущих клиентов, написать кейсы, в которых делать акцент на личное вовлечение Вашего ТОП-менеджмента.</li>
    </ol>
<p>Все эти PR события должны быть сопровождены медикампанией: широко освещаться в социальных сетях, на сайте компании, в рекламе, раздаточных материалах, в видео, в коммерческих предложениях и перекрестно на самих мероприятиях (обязательно упоминать о достижениях, например, на слайдах презентаций). В целом везде, где это только можно и, разумеется, уместно! Дополнительный плюсом может стать получение положительных отзывов от лидеров мнения.</p>
<p>Также важно следить за обратной связью! Делайте опросы, ведь мнение Ваших клиентов — это прямой путь к тому, чтобы сделать Ваш бизнес эффективнее.</p>
<p>Всё это будет работать при едином продуманном посыле. То есть все эти действия и этапы должны быть завязаны на конкретных идеях, метасообщениях, в которых ЦА получала бы чёткое понимание конкурентных преимуществ Вашего бизнеса, а сам бизнес приобретал новых сторонников — адвокатов бренда!</p>
<p>Реализуйте PR в сегменте B2B на практике и пусть Ваши продажи растут!</p>
<br>
<p>Автор: <a style="font-weight:bold; text-decoration: underline;" target="_blank" rel="nofollow noindex" href="https://www.linkedin.com/in/margarita-melikyan-6a2036160/">Маргарита Меликян</a></p>
      `,
    },
    {
      id: 10,
      title: 'Проведение B2B маркетинговых исследований',
      slug: 'research-sample-b2b',
      seoTitle: 'Проведение B2B маркетинговых исследований: особенности, трудности и выборка',
      seoDescription: 'B2B-маркетинговые исследования в Украине, проблемы, особенности и формирование выборки, значительно отличается от выборок на потребительских рынках.',
      canonical: '/ru/blog/research-sample-b2b',
      image: '/images/blog/covers/research-sample-b2b.jpg',
      imageAlt: 'Проведение B2B маркетинговых исследований: особенности, трудности и выборка',
      date: '2018-02-15',
      views: 500,
      topics: ['Маркетинг', 'Исследования'],
      fullText: `

<p><img style="background:#000;" class="border-12" src="/images/blog/b2b-vyborka.png" alt="Проведение B2B маркетинговых исследований: выборка и нюансы" width="1238" height="919" /></p>
<br>
<p>Данная статья — продолжение серии статей о формировании выборки на различных типах рынка. Предлагаю рассмотреть вопросы подходов к определению размера выборки в B2B-маркетинговых исследованиях, особенности и нюансы, с которыми можно столкнуться при проведении исследований рынка в сегменте B2B.</p>

<h2>Особенности классификации компаний на B2B-рынках</h2>
<p>Как в случае с исследованиями потребительских рынков — на деловых рынках (B2B) за редким исключением (монополия или олигополия) крайне сложно опросить все компании, работающие на исследуемом географическом рынке или нише.</p>
<p>Как ни удивительно, но в настоящий момент не существует единого стандартизированного подхода к формированию выборки на рынках business-to-business при B2B-исследованиях. Например, даже самые авторитетные справочники, такие, как <a href="http://www.kompass.ua/" target="_blank" rel="nofollow noopener noreferrer">Kompass</a>, содержащий более 343 тыс. украинских компаний и более 12 млн. компаний из 68 стран мира, могут не содержать множества компаний-представителей малого бизнеса, совокупная доля рынка которых может исчисляться десятками процентов. Более того, часть из предприятий сложно сортировать в контексте узкоспециализированных ниш, например, при исследовании рынка нигрола (не все из указанных фирм нефтехимической отрасли занимаются реализацией промышленного нигрола). Таким образом, определение в рамках задач исследования сектора или ниши может не совпадать с существующей обобщенной классификации компаний.</p>
<p>Всё это значительно усложняет не только процесс выборки, но и непосредственный поиск предприятий для дальнейшей выборки при b2b-маркетинговом исследовании.</p>
<p>Что может придти на помощь? — Поисковые системы. Можно просто набрать в поиск необходимые продукты или параметры фирмы, соответствующие задачам B2B исследования, и получить список компаний. Минус такого подхода заключается в том, что определенная часть генеральной совокупности участников рынка может увлекаться <a title="Раскрутка сайта — это один из самых высокорентабельных инструментов интернет-маркетинга и развития бизнеса онлайн, в частности электронной коммерции." href="/ru/seo">SEO</a> для своего продвижения, и в поле зрения может не попасть часть компаний, занимающих значительную долю рынка, но использующих в качестве основных другие каналы сбыта, например, реализацию через первый и даже второй канал сбыта продукции — сеть дистрибъюторов, инсталляторов и дилеров.</p>
<p>В своей практике мы применяем оба эти метода: использование авторитетных справочников и данные поискового анализа.</p>
<p>Итак, с методами мы определились, теперь переходим к нюансам непосредственно определения выборки при проведении маркетинговых исследований B2B.</p>

<h3>Проблема №1. Размер компаний.</h3>
<p>Возьмём для примера аптечный рынок... В масштабах аптечного рынка Украины существуют как крупные сетевые компании, в штате которых более 10000 работников, так и мелкие локальные игроки, в аптечных точках которых могут работать всего пару человек. Тоже самое с уже приведенным в пример рынок нигрола — ФОП, занимающийся изготовлением нигрола для тракторов по программе private lable и такие гиганты, как УКРТАТНАФТА.</p>
<p>Поэтому в B2B-маркетинговых исследованиях мы предлагаем примерить следующий подход — правило Парето, то есть 80 на 20. 80% данных о рынке можно получить от 20% компаний, представленных на нём. Тут важно отметить, что 20% обязательно должны войти крупные предприятия, которые должны быть опрошены обязательно, в остальную группу можно включить часть более мелких игроков ниже черты, отмеченной на рисунке ниже. Для этого можно использовать как вероятностные, так и невероятностные методы, например, кластерную выборку, случайную, или квотную выборку.</p>
<br>
<p><img class="border-12" src="/images/blog/vyborka-v-b2b-marketingovyh-issledovanijah.jpg" alt="Определение размера выборки в B2B маркетинговых исследованиях" width="1139" height="637" /></p>
<br>
<h3>Проблема №2. Критерий определения размера предприятия.</h3>
<p>Казалось бы, определились. Но нет!</p>
<p>Как понять кроме очевидных случаев, какая компания является крупной, а какая нет?</p>
<p>Например, такими критериями могут быть:</p>
    <ul>
      <li>товарооборот (данные о котором не так-то просто получить)</li>
      <li>количество работников (косвенный показатель, по которому сложно говорить об эффективности)</li>
      <li>объёмы производства</li>
      <li>размер дилерской сети</li>
      <li>прочие.</li>
    </ul>
<p>И как без непосредственного исследования данных о формах определить тех, кто должен попасть в выборку для b2b-исследования?</p>
<p>Здесь требуется опыт и профессиональная интуиция + здравый смысл исследователя...</p>
<h3>Проблема №3. Кого опросить в этих компаниях?</h3>
<p>На потребительском рынке всё гораздо проще: есть целевая аудитория, у неё и спросим. Но что мы имеем здесь? В рамках одного предприятия может быть множество отделов, участвующих в принятии решений по интересующим заказчика маркетингового исследования вопросам, например, технологический, отдел продаж, дирекция, отдел маркетинга, производственный отдел, отдел снабжения и прочие. Более того, в разных компаниях один и тот же вопрос может решать в различных отделах даже при схожей структуре предприятия. И в добавок, со временем в одной и той же фирме компетенция может перейти из одних <span style="text-decoration: line-through;">голов</span> рук в другие. С кем из них проводить интервью?</p>
<p>При выборке 100 компаний (для маркетингового исследования B2B рынка это вполне репрезентативный объём) можно до непосредственного интервьюирования лица принимающего решение (ЛПР) провести мини опрос для его выявления. И обязательно внести в анкету графу должность ЛПР и структурный отдел в компании. Это однозначно дополнит картину в целом и поможет в принятии опирающихся на объективные данные о b2b-рынке стратегических управленческих решений!</p>

<p>Успехов в определении размера выборки и проведении b2b-маркетинговых исследований!</p>
      `,
    },

    // другие статьи
  ];
  